{
    "plannedsessions": [
        {
            "_id": "icpjduamTbLHq3Rh2",
            "conferencename": "Øredev 2022",
            "sessionDescription": "> 'Yes, that's it,' said the Hatter with a sigh: 'it's always tea-time, and we've no time to wash the things between whiles.'\n\nThe Mad Hatter obviously worked in software development. Time and time again we know what we should do but we don't do it. To live in the Mad Hatters' world we need to organise ourselves for the here and now.\n\n> ‘Would you tell me, please, which way I ought to go from here?'\n> 'That depends a good deal on where you want to get to,' said the Cat.\n> 'I don’t much care where—' said Alice.\n> 'Then it doesn’t matter which way you go,' said the Cat.\n> '—so long as I get somewhere,' Alice added\n> > 'Oh, you’re sure to do that,' said the Cat, 'if you only walk long enough.'\n\nIs that it, live in the here and now and don't worry about where you want to get to? Or is there a mean of navigating to a goal even when its always time for tea? How can we reconcile the Mad Hatter's problem with the Cheshire Cat's prophecy?",
            "sessionKeyTakeAway1": "Thoughts about how to reconcile today's urgency with  ambitions.",
            "sessionKeyTakeAway2": "Be inspired",
            "sessionLevel": "10",
            "sessionSpeakerName": "Allan Kelly",
            "sessionSpeakersOther": [],
            "sessionTagMain": "Keynote",
            "sessionTags": [],
            "sessionTitle": "Always time for tea",
            "sessionType": "40",
            "sessionURL": "always-time-for-tea",
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§SMpH8XCoBZXKY5f9n§1",
            "sessionScheduleRoom": "Wonderland",
            "sessionScheduleSlot": "1",
            "sessionSpeakerImagePuId": "2022_speakers/allan-allankelly-net",
            "sessionSpeakerURL": "allan-kelly",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "09:00:00"
        },
        {
            "_id": "BJumyhmy4AXcvPmen",
            "conferencename": "Øredev 2022",
            "sessionDescription": "In this session we will be taking a look at the results of the 2022 Global DevSecOps survey conducted by GitLab.  We consider all roles within teams practising DevSecOps, and will uncover interesting statistics and trends within those teams.",
            "sessionKeyTakeAway1": "You will gain an insight into the highlights of the GitLab 2022 DevSecOps survey.",
            "sessionKeyTakeAway2": "You will see how DevOps platforms have enabled faster and more secure releases.",
            "sessionLevel": "10",
            "sessionSpeakerName": "Martin McVay",
            "sessionTagMain": "DevOps",
            "sessionTags": [
                "People & Teams",
                "Quality & Test"
            ],
            "sessionTitle": "Thriving in an Insecure World",
            "sessionType": "40",
            "sessionURL": "thriving-in-an-insecure-world",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§mLsppTucSgZEvLukS§2",
            "sessionScheduleRoom": "Downstairs",
            "sessionScheduleSlot": "2",
            "sessionSpeakerImagePuId": "2022_speakers/mmcvay-gitlab-com",
            "sessionSpeakerURL": "martin-mcvay",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "10:30:00"
        },
        {
            "_id": "WJoHBj7YN9RNgK427",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Team change is inevitable, especially when your company is hiring like crazy or when it is shrinking. Your teams might grow bigger and split. Some people might leave and then your teams merge together. What feels like tectonic shifts happen as you morph structurally to refocus people and work, continuously. It can be a wild ride.  How can we bring a humanistic stance to this dynamic reteaming? How can the people be empowered to have ownership over their team change? How can we integrate the new people, honor who is already there and redefine our collective sense of “culture?” We will explore questions like these and will discover practical strategies to master dynamic reteaming.",
            "sessionKeyTakeAway1": "Learn the 5 patterns of dynamic reteaming and tactics that make it easier when you encounter them.",
            "sessionKeyTakeAway2": "Understand how to work with, and accept team change, rather than trying to prevent it.",
            "sessionLevel": "20",
            "sessionSpeakerName": "Heidi Helfand",
            "sessionTagMain": "People & Teams",
            "sessionTags": [],
            "sessionTitle": "Dynamic Reteaming at Fast-Changing Companies",
            "sessionType": "40",
            "sessionURL": "dynamic-reteaming-at-fast-changing-companies",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§Z569Ch8xnaEsMZjir§2",
            "sessionScheduleRoom": "Nowhere",
            "sessionScheduleSlot": "2",
            "sessionKeyTakeAway3": "Get strategies for catalyzing team change and including people in decision making.",
            "sessionTitleShort": "Dynamic Reteaming",
            "sessionSpeakerImagePuId": "2022_speakers/heidi-helfand-gmail-com",
            "sessionSpeakerURL": "heidi-helfand",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "10:30:00"
        },
        {
            "_id": "bH5zDWydw5TqLGZE2",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Animation is a great way to add polish to an interface and guide a user through a task, but animating on the web can be anything but predictable! How do we achieve smooth UI transitions when dealing with DOM changes, responsive layouts, dynamic content and user input? Well... we start off by flipping our whole approach upside down.\nJoin Cassie as she talks through some ‘impossible’ animation challenges, and how to approach them with a rather magical animation technique.",
            "sessionKeyTakeAway1": "You will learn a new way to think about animation on the web",
            "sessionKeyTakeAway2": "You will gain some insights into how to animate more effectively with GSAP",
            "sessionKeyTakeAway3": "You will feel inspired to experiment with animation",
            "sessionKeyTakeAway4": "You will be able to tackle animating complex and 'impossible' state changes",
            "sessionLevel": "20",
            "sessionSpeakerName": "Cassie Evans",
            "sessionTagMain": "Web",
            "sessionTags": [],
            "sessionTitle": "Animating the Impossible",
            "sessionTitleShort": "Animating the Impossible",
            "sessionType": "40",
            "sessionURL": "animating-the-impossible",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§eWnqdASsnFYcsWrZC§2",
            "sessionScheduleRoom": "Somewhere",
            "sessionScheduleSlot": "2",
            "sessionSpeakerImagePuId": "2022_speakers/hi-cassie-codes",
            "sessionSpeakerURL": "cassie-evans",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "10:30:00"
        },
        {
            "_id": "J2axsy78FjFH5kPja",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Ultimately our work can be measured by how it behaves in the real world. Usage analytics provides rich seams of data we can analyse and apply to gauge our previous work and guide our future work. Don't drown in regression testing, test coverage, or responding to bug reports, in this session you can learn how to adapt and adopt usage analytics to up your game and make your work more enjoyable.",
            "sessionKeyTakeAway1": "How users use software can provide insights into our testing and engineering practices if we choose to adopt usage analytics into our practices.",
            "sessionKeyTakeAway2": "Testing is part of the puzzle, not the solution.",
            "sessionKeyTakeAway3": "Learn why usage analytics matters to you, to your users, and to your organisation and how you can leverage it to make your work more fulfilling and fun.",
            "sessionLevel": "20",
            "sessionSpeakerName": "Julian Harty",
            "sessionTagMain": "Quality & Test",
            "sessionTags": [
                "Web",
                "Mobile",
                "Architecture",
                "People & Teams",
                "DevOps"
            ],
            "sessionTitle": "Better software sooner by adopting usage analytics",
            "sessionType": "40",
            "sessionURL": "better-software-sooner-by-adopting-usage-analytics",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§AgyfqDGL2sPCs4Ycj§2",
            "sessionScheduleRoom": "This way",
            "sessionScheduleSlot": "2",
            "sessionSpeakerImagePuId": "2022_speakers/julianharty-gmail-com",
            "sessionSpeakerURL": "julian-harty",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "10:30:00"
        },
        {
            "_id": "6mbSYtzk7pBvHgJYv",
            "sessionTitle": "A cheapskate's guide to Azure",
            "sessionLevel": "10",
            "sessionType": "40",
            "sessionTagMain": "Cloud",
            "sessionTags": [
                "Architecture"
            ],
            "sessionKeyTakeAway1": "You will be able to create cheaper solutions on Azure",
            "sessionKeyTakeAway2": "You will learn which services on Azure that can compliment each other very good and save you cost as well",
            "sessionKeyTakeAway3": "You will learn that some of Azures services are very expensive and learn of cheaper alternatives",
            "sessionDescription": "Does the fear of increased costs keep you from moving your on-premise solution to the cloud? Or do you feel that you are paying too much for your current cloud solution?\n \nI am a cheapskate and I thoroughly enjoy paying as little as I can on my cloud services usage.  Microsoft Azure is a great platform to use when creating your next cloud native solution. But maybe you have head or felt that it can be a tad expensive? Let us change this!\n \nThere are a whole lot of services to choose from on Microsoft Azure. Some are very expensive, and some are cheap. The same services can be cheap for high usage, but expensive for low usage and vice-versa. So how do you know which services to use? And how do I set up my solution so that it as cheap as it can be for my usage? Is the service that advertises a large generous free tier, or the one that has just received a new consumption-based pricing model, the service cheapest for you in the long run?\n \nIn this talk we will compare some of the more known services against each other using my \"Stinginess-scale\". I will show some simple changes that can be done to some of the more known reference architectures to make them cheaper. And share some of my best tips & tricks on how to architecture cheap solutions on Microsoft Azure.\n \nI hope that you will leave this talk inspired and with new knowledge on how to save money on your current or next cloud solution!",
            "conferencename": "Øredev 2022",
            "sessionURL": "a-cheapskate-s-guide-to-azure",
            "sessionSpeakerName": "Karl Løland",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§fcC2ASEZqJbm2mzhT§2",
            "sessionScheduleRoom": "Upstairs",
            "sessionScheduleSlot": "2",
            "sessionSpeakerImagePuId": "2018_speakers/karl-syvert-myerart-net",
            "sessionSpeakerURL": "karl-l-land",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "10:30:00"
        },
        {
            "_id": "dC8XZZyfhGepYpQbc",
            "conferencename": "Øredev 2022",
            "sessionDescription": "A discussion between a programmer and a member of parliament about how society changes and what responsibility/opportunity each person in the digital business has to be part of the foundations of our society.\n\nWe discuss from a few different vantage points and use examples such as Öppna Skolplattformen to explain how a closed collaboration between the open source community and public sector can help build a better society.",
            "sessionKeyTakeAway1": "You will reflect on what the politics can and can’t do",
            "sessionKeyTakeAway2": "You will be empowered to use your powers to do good",
            "sessionKeyTakeAway3": "You will learn about societal change and activism",
            "sessionKeyTakeAway4": "You will learn about the importance of open source and open data",
            "sessionLevel": "20",
            "sessionSpeakerName": "Christian Landgren",
            "sessionTagMain": "Polyglot & Fringe",
            "sessionTags": [
                "Data Science",
                "People & Teams"
            ],
            "sessionTitle": "Code change the world, but for good?",
            "sessionType": "40",
            "sessionURL": "code-change-the-world-but-for-good-",
            "sessionSpeakersOther": [
                "wp2Rdj6o9rNWpPTXp"
            ],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§SMpH8XCoBZXKY5f9n§2",
            "sessionScheduleRoom": "Wonderland",
            "sessionScheduleSlot": "2",
            "sessionSpeakerImagePuId": "2022_speakers/christian-landgren-iteam-se",
            "sessionSpeakerURL": "christian-landgren",
            "otherSpeakersShow": [
                {
                    "_id": "wp2Rdj6o9rNWpPTXp",
                    "speakerFirstName": "Niels",
                    "speakerLastName": "Paarup-Petersen",
                    "speakerURL": "niels-paarup-petersen",
                    "speakerImagePuId": "2022_speakers/nielspaarup-gmail-com"
                }
            ],
            "sessionScheduleTime": "10:30:00"
        },
        {
            "_id": "sHdyZCyAHJxSAnGp4",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Staying up to date with one of the most fast paced and exciting platforms is no  easy task.  In this talk we'll cover the latest and greatest features of .NET, as well as give a sneak peek at some of the things that are in store for the future. Whether you're new to .NET or a seasoned vet, this talk will have something for you.",
            "sessionKeyTakeAway1": "You will learn how we got to where we are today",
            "sessionKeyTakeAway2": "What has happened the last year or two",
            "sessionKeyTakeAway3": "And what the future brings",
            "sessionKeyTakeAway4": "At the end you will be up to date with .NET, and know how it affects you and what you can expect",
            "sessionLevel": "10",
            "sessionSpeakerName": "Iris Classon",
            "sessionTagMain": ".NET",
            "sessionTags": [
                "Web"
            ],
            "sessionTitle": ".NET. What's new, and what's coming?",
            "sessionType": "40",
            "sessionURL": "-net-what-s-new-and-what-s-coming-",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§LYCz3myi2sMKuztYB§2",
            "sessionScheduleRoom": "Wrong way",
            "sessionScheduleSlot": "2",
            "sessionSpeakerImagePuId": "2022_speakers/iris-irisclasson-com",
            "sessionSpeakerURL": "iris-classon",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "10:30:00"
        },
        {
            "_id": "xrJLKBTGsbnBcqvQw",
            "conferencename": "Øredev 2022",
            "sessionDescription": "web3.storage is a system living on top of Interplanetary File System (IPFS) to provide non technical people access to a completely decentralized file sharing network designed to preserve and grow humanity's knowledge.\nThe massive success of the initiative quickly brought the system to a point were it was not able to handle the growth. Uploaded files were only available for downloads after several days due to limited capacity. Adding new processing nodes took literally days due to the complex bootstrap procedures mandated by the different network protocols involved.\nIn this talk I will show how we have been able to migrate to a new fully stateless system by carefully making assumption and leveraging AWS services. We developed a system that now can perform infinite horizontal scalability and it is able to consistently handle millions of uploads per day.",
            "sessionKeyTakeAway1": "How to design an architecture for infinite scaling",
            "sessionKeyTakeAway2": "How to greatly reduce invocations by apply reduction techniques to the data",
            "sessionKeyTakeAway3": "What to consider when dealing with distributed architectures in decentralized protocols",
            "sessionLevel": "30",
            "sessionSpeakerName": "Paolo Insogna",
            "sessionTagMain": "Cloud",
            "sessionTags": [
                "Architecture"
            ],
            "sessionTitle": "Horizontal Scaling of a Web3 system to the sky and beyond in AWS",
            "sessionType": "40",
            "sessionURL": "horizontal-scaling-of-a-web3-system-to-the-sky-and-beyond-in-aws",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§mLsppTucSgZEvLukS§3",
            "sessionScheduleRoom": "Downstairs",
            "sessionScheduleSlot": "3",
            "sessionSpeakerImagePuId": "2022_speakers/paolo-insogna-nearform-com",
            "sessionSpeakerURL": "paolo-insogna",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "11:30:00"
        },
        {
            "_id": "NJikAF6RaqkZWKp6B",
            "conferencename": "Øredev 2022",
            "sessionDescription": "In recent years it has become clear that machine learning models are susceptible to a range of attacks with different purposes, for example to extract private user data. In this session you will get an insight into the different threats and how you can mitigate them, looking at available defences and their costs. We will also introduce an open source tool developed by Zalando and Fraunhofer Institute to help you get started in testing leakage and vulnerabilities of your models.",
            "sessionKeyTakeAway1": "Your ML system is leaking (potentially private) data.",
            "sessionKeyTakeAway2": "Your ML models will be attacked and there are threat models that will help you anticipate them.",
            "sessionKeyTakeAway3": "There are defences against attacks on ML models, but they come at a cost.",
            "sessionKeyTakeAway4": "There are open source tools to to help you get started in testing the leakage and vulnerability of your models.",
            "sessionLevel": "10",
            "sessionSpeakerName": "Håkan Jonsson",
            "sessionTagMain": "Data Science",
            "sessionTags": [
                "Security"
            ],
            "sessionTitle": "Privacy preserving machine learning",
            "sessionTitleShort": "Privacy preserving machine learning",
            "sessionType": "40",
            "sessionURL": "privacy-preserving-machine-learning",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§Z569Ch8xnaEsMZjir§3",
            "sessionScheduleRoom": "Nowhere",
            "sessionScheduleSlot": "3",
            "sessionSpeakerImagePuId": "2022_speakers/hakan-jonsson-zalando-de",
            "sessionSpeakerURL": "h-kan-jonsson",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "11:30:00"
        },
        {
            "_id": "mTiFJAoeYtuQDYbot",
            "conferencename": "Øredev 2022",
            "sessionDescription": "A deep dive into how Flutter works; from its layered architecture, all the way to how it uses the widget tree to render components on the screen.\n\nThis talk aims to demystify how Flutter is built and how it helps developers create unique and performant mobile apps, by allowing them to have fast development cycles and customized animations and look and feel.",
            "sessionKeyTakeAway1": "You will understand Flutter's architecture",
            "sessionKeyTakeAway2": "You will understand how Flutter draws widgets on screen",
            "sessionKeyTakeAway3": "You will understand Flutter's widget lifecycle",
            "sessionLevel": "10",
            "sessionSpeakerName": "Efthymios Sarmpanis",
            "sessionTagMain": "Mobile",
            "sessionTags": [],
            "sessionTitle": "Flutter under the hood. What makes Flutter tick",
            "sessionType": "40",
            "sessionURL": "flutter-under-the-hood-what-makes-flutter-tick",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§eWnqdASsnFYcsWrZC§3",
            "sessionScheduleRoom": "Somewhere",
            "sessionScheduleSlot": "3",
            "sessionSpeakerImagePuId": "2022_speakers/e-sarbanis-gmail-com",
            "sessionSpeakerURL": "efthymios-sarmpanis",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "11:30:00"
        },
        {
            "_id": "nhHjGpk2ERcAxuoPE",
            "conferencename": "Øredev 2022",
            "sessionDescription": "We'll take a tour of Nuxt 3, creating, building and deploying a real, live-coded app to a serverless environment. We'll talk about how changing requirements in today's serverless world require frameworks to change, and how that makes a difference for UX and performance. Along the way, we'll also explore how Nuxt 3 makes developer life easier, some cool new features from the CLI and available within nitropack, the new rendering framework designed for the edge, plus a sneak peak of what's coming next.",
            "sessionKeyTakeAway1": "Understand bigger trends within JAMstack that are changing the way we need to render web apps",
            "sessionKeyTakeAway2": "Explore cutting edge technologies that can be used to create universal and minimal applications",
            "sessionKeyTakeAway3": "Be able to build and deploy a Nuxt 3 app using Nitro to the edge",
            "sessionLevel": "20",
            "sessionSpeakerName": "Daniel Roe",
            "sessionTagMain": "Web",
            "sessionTags": [
                "Cloud",
                "Architecture",
                "DevOps"
            ],
            "sessionTitle": "Building for the Edge with Nuxt 3",
            "sessionType": "40",
            "sessionURL": "building-for-the-edge-with-nuxt-3",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§AgyfqDGL2sPCs4Ycj§3",
            "sessionScheduleRoom": "This way",
            "sessionScheduleSlot": "3",
            "sessionSpeakerImagePuId": "2022_speakers/daniel-roe-dev",
            "sessionSpeakerURL": "daniel-roe",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "11:30:00"
        },
        {
            "_id": "SC4yzaAqCeJmZvgwe",
            "conferencename": "Øredev 2022",
            "sessionDescription": "\"The best functions and classes are the ones you already have with you.” Let Sebastian Aigner take you on a journey through the features you get out of the box with Kotlin. From string manipulation to collection modification, the Kotlin standard library gives you powerful tools for many common programming task that can make you a more efficient and expressive developer. See what gems you may not have uncovered yet, extend your Kotlin vocabulary, and impress friends and family with an even stronger grasp of Kotlin’s built-in classes and functions. Whether you’re new to Kotlin, or have years of experience – you’ll discover something new!",
            "sessionKeyTakeAway1": "(Re)learn the basics of what the Kotlin standard library has to offer",
            "sessionKeyTakeAway2": "Discover some hidden gems that you can use in all Kotlin programs, and that help you build a shared vocabulary with other developers.",
            "sessionLevel": "10",
            "sessionSpeakerName": "Sebastian Aigner",
            "sessionTagMain": "JVM",
            "sessionTags": [],
            "sessionTitle": "Back to the Stdlib: Making the Most of Kotlin’s Standard Library",
            "sessionURL": "back-to-the-stdlib-making-the-most-of-kotlin-s-standard-library",
            "sessionSpeakersOther": [],
            "sessionTitleShort": "Back to the Kotlin Standard Library",
            "sessionType": "40",
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§fcC2ASEZqJbm2mzhT§3",
            "sessionScheduleRoom": "Upstairs",
            "sessionScheduleSlot": "3",
            "sessionSpeakerImagePuId": "2022_speakers/sebastian-aigner-jetbrains-com",
            "sessionSpeakerURL": "sebastian-aigner",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "11:30:00"
        },
        {
            "_id": "r8B7kiJetzqMzx8sb",
            "conferencename": "Øredev 2022",
            "sessionDescription": "What's in the .git folder? How are commits stored? How do branches work? We'll dive deep into the objects folder, unpack commits, look at the types of DAG nodes, examine object content, and build a complete visualization of the stored content. We'll also quickly look through Git hooks, Git config, and ref logs. Come experience the zen of git.",
            "sessionKeyTakeAway1": "How do commits get stored in Git? (e.g. what's in the objects folder)",
            "sessionKeyTakeAway2": "How do branches & tags & remotes work? (e.g. what's in the refs folder)",
            "sessionKeyTakeAway3": "How can I automate tasks on Git events? (e.g. what's in the hooks folder)",
            "sessionKeyTakeAway4": "How can I tweak configuration? (e.g. what's in the gitconfig and how does it cascade?)",
            "sessionLevel": "30",
            "sessionSpeakerName": "Rob Richardson",
            "sessionTagMain": "DevOps",
            "sessionTags": [
                "Web",
                "Architecture",
                "Quality & Test"
            ],
            "sessionTitle": "The Definitive Deep Dive into the .git Folder",
            "sessionTitleShort": "The Definitive Deep Dive into the .git Folder",
            "sessionType": "40",
            "sessionURL": "the-definitive-deep-dive-into-the-git-folder",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§SMpH8XCoBZXKY5f9n§3",
            "sessionScheduleRoom": "Wonderland",
            "sessionScheduleSlot": "3",
            "sessionSpeakerImagePuId": "2022_speakers/robrich-robrich-org",
            "sessionSpeakerURL": "rob-richardson",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "11:30:00"
        },
        {
            "_id": "rZzLdvy6WZk2DfsYT",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Traditional wisdom teaches us that long-lived, stable teams perform best, and that changing team membership is to be avoided as much as possible. At Redgate Software we’ve challenged this advice, believing it was better for our engineers and the overall organisation to deliberately change-up our teams every year.\n\nOur approach has been to give people a strong influence over which team they will join, encouraging them to move towards the work they find most engaging. Perhaps surprisingly, this has been hugely successful and has helped us create a development culture of engagement, resilience and opportunity.\n\nChris will share how Redgate came to try self-selection team reorganisation in the first place. He’ll talk about how this has become an established annual event, the challenges and benefits, and how to try the approach in your organisation.",
            "sessionKeyTakeAway1": "Why you should consider deliberately changing your teams",
            "sessionKeyTakeAway2": "Why and how Redgate ran their self-selection process",
            "sessionLevel": "20",
            "sessionSpeakerName": "Chris Smith",
            "sessionSpeakersOther": [],
            "sessionTagMain": "People & Teams",
            "sessionTags": [],
            "sessionTitle": "Four years of team self-selection at Redgate Software",
            "sessionType": "40",
            "sessionURL": "four-years-of-team-self-selection-at-redgate-software",
            "sessionKeyTakeAway3": "What happened as a result of deliberate reteaming at Redgate",
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§LYCz3myi2sMKuztYB§3",
            "sessionScheduleRoom": "Wrong way",
            "sessionScheduleSlot": "3",
            "sessionSpeakerImagePuId": "2022_speakers/chris-smith-red-gate-com",
            "sessionSpeakerURL": "chris-smith",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "11:30:00"
        },
        {
            "_id": "DAxd6oYQe38JeuyAP",
            "sessionTitle": "Practical tips to elevate your UX and accessibility",
            "sessionLevel": "10",
            "sessionType": "40",
            "sessionTagMain": "Web",
            "sessionTags": [],
            "sessionKeyTakeAway1": "How to improve your users' experience",
            "sessionKeyTakeAway2": "Adapting your solution to increase the accessibility",
            "sessionDescription": "As humans we have limitations like perception, focus, concentration, distractions, sight, you name it.\n\nAdapting our solution to increase the accessibility isn't something we should do as an afterthought or because \"someone might have a hard time seeing colors\". It's something that we should incorporate from the beginning.\n\nWith a simple mindset shift to start recognizing that there is in fact a human with a brain (with all the glory and limitations) on the other end of your solution, the experience for both the users and you will increase enormously.\n\nThere are hundreds of UX-principles, laws and rules but there often isn't time or resources to study and learn all these, especially as developers.\n\nJessica will show a few easy steps to start to improve your UX and accessibility regardless of if you develop for desktop, web or mobile.",
            "conferencename": "Øredev 2022",
            "sessionURL": "practical-tips-to-elevate-your-ux-and-accessibility",
            "sessionSpeakerName": "Jessica Engström",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§mLsppTucSgZEvLukS§4",
            "sessionScheduleRoom": "Downstairs",
            "sessionScheduleSlot": "4",
            "sessionSpeakerImagePuId": "2022_speakers/jessica-catoholic-se",
            "sessionSpeakerURL": "jessica-engstr-m",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "13:00:00"
        },
        {
            "_id": "oyiWBea8X8HyGd3ng",
            "conferencename": "Øredev 2022",
            "sessionDescription": "In large and complex software systems, the allocation of responsibilities to different parts of architecture is a key concern. Over time responsibilities can span across multiple parts inappropriately and the parts themselves can become overburdened with too many responsibilities.\n\n\nIn this talk, Michael Feathers will describe a lightweight process for creating Responsibility Indices, models that index into information specific to each responsibility in a system: quality measures, refactoring plans, and strategy-based rules for change. By considering responsibilities more primary than physical location in code, teams are able to bring code and responsibility into alignment and track information needed for effective decision making that enhances cohesion over time.",
            "sessionKeyTakeAway1": "What Responsibility Indicies are, and why they are valuable",
            "sessionKeyTakeAway2": "How to map and document the responsibility of a system to create effective decision making when coding",
            "sessionLevel": "20",
            "sessionSpeakerName": "Michael Feathers",
            "sessionTagMain": "Architecture",
            "sessionTags": [
                "People & Teams"
            ],
            "sessionTitle": "Aligning Architecture with Responsibility Indices",
            "sessionType": "40",
            "sessionURL": "aligning-architecture-with-responsibility-indices",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§Z569Ch8xnaEsMZjir§4",
            "sessionScheduleRoom": "Nowhere",
            "sessionScheduleSlot": "4",
            "sessionSpeakerImagePuId": "2022_speakers/michael-feathers-r7krecon-com",
            "sessionSpeakerURL": "michael-feathers",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "13:00:00"
        },
        {
            "_id": "J9mytW8w4bHMWyk4J",
            "sessionTitle": "CSS for internationalisation",
            "sessionTitleShort": "CSS for i18n",
            "sessionLevel": "20",
            "sessionType": "40",
            "sessionTagMain": "Web",
            "sessionKeyTakeAway1": "What the key things are in making sure browsers know what language your website speaks",
            "sessionKeyTakeAway2": "Which CSS properties can help you present textual content in a manner that provides the best experience for native speakers",
            "sessionKeyTakeAway3": "How to cater for writing scripts that are not the default top-to-bottom, left-to-right",
            "sessionDescription": "Internationalisation is more than translating the content on your site into multiple languages and calling it a day. There are various nuances to the presentation of that content which affect the experience of a native speaker using your site. There are CSS properties that provide layout and typographic capabilities for scripts and writing systems beyond the Latin-based horizontal top-to-bottom ones that are predominantly seen on the web today.",
            "conferencename": "Øredev 2022",
            "sessionURL": "css-for-internationalisation",
            "sessionSpeakerName": "Hui Jing Chen",
            "sessionSpeakersOther": [],
            "sessionTags": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§eWnqdASsnFYcsWrZC§4",
            "sessionScheduleRoom": "Somewhere",
            "sessionScheduleSlot": "4",
            "sessionSpeakerImagePuId": "2022_speakers/huijing-hey-com",
            "sessionSpeakerURL": "hui-jing-chen",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "13:00:00"
        },
        {
            "_id": "47WpZEHTwtsJexGEj",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Many data science and machine learning projects fail which then cause high risks for companies. In product development, there is a concept called “lean startup” which is all about minimizing risks. In this talk, I will present how lean concepts can be used for ML projects and how both of them are actually very related to each other. I will also present some projects which applied those ideas. And yes those are cool deep learning projects.",
            "sessionKeyTakeAway1": "Understand the nature of ML projects",
            "sessionKeyTakeAway2": "Product management can help derisk ML projects",
            "sessionLevel": "10",
            "sessionSpeakerName": "Dat Tran",
            "sessionSpeakersOther": [],
            "sessionTagMain": "Data Science",
            "sessionTags": [],
            "sessionTitle": "How to Implement a Production-Ready Deep Learning Model in 12 Weeks",
            "sessionTitleShort": "Lean AI",
            "sessionType": "40",
            "sessionURL": "how-to-implement-a-production-ready-deep-learning-model-in-12-weeks",
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§AgyfqDGL2sPCs4Ycj§4",
            "sessionScheduleRoom": "This way",
            "sessionScheduleSlot": "4",
            "sessionSpeakerImagePuId": "2022_speakers/dat-tran-priceloop-ai",
            "sessionSpeakerURL": "dat-tran",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "13:00:00"
        },
        {
            "_id": "73Jmct68QfooZ9vZR",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Modern IDEs are quite complex. Even IDE developers say that they sometimes discover new features only while reading the IDE's code. And does this sound familiar: your colleague is trying to find a class in the project tree, and he doesn't remember the name of the class, and so you are trying hard to scream:\"Just press Ctrl+Shift+E!!!\"\n\nGenerally, developers just use IDE and so often do not utilize the power of automated refactorings, shortcuts, fast navigation, and other awesome features that IDEs provide.\n\nThe audience will learn a lot of tips and tricks, and a lot of different shortcuts will be also covered.",
            "sessionKeyTakeAway1": "Setting up the IDE for efficient use and navigation (hint: zen mode and how to get around)",
            "sessionKeyTakeAway2": "Typing can be fast even if you're bad at it: live templates, shortcuts, various completions, refactoring",
            "sessionKeyTakeAway3": "Other useful integrated tools: database access, debugging the apps, diagrams, and other useful tools as the time permits",
            "sessionLevel": "20",
            "sessionSpeakerName": "Anton Arhipov",
            "sessionTagMain": "JVM",
            "sessionTags": [],
            "sessionTitle": "IntelliJ IDEA Tips and Tricks",
            "sessionType": "40",
            "sessionURL": "intellij-idea-tips-and-tricks",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§fcC2ASEZqJbm2mzhT§4",
            "sessionScheduleRoom": "Upstairs",
            "sessionScheduleSlot": "4",
            "sessionSpeakerImagePuId": "2022_speakers/anton-arhipov-jetbrains-com",
            "sessionSpeakerURL": "anton-arhipov",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "13:00:00"
        },
        {
            "_id": "dCN92PundvNKLMLPz",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Oredev\n\nThe vast majority of mobile applications leverage the use of third party libraries. Besides their main purpose, many of them will also collect and send your private information, using your data for their own benefit. For the past 18 months, we've been working on a solution that blocks all those trackers from any app in your device. This talk describes in detail the technology behind it, what Android APIs are used and lessons learnt through the whole process.",
            "sessionKeyTakeAway1": "You will discover that more than 90% of websites and apps are tracking you.",
            "sessionKeyTakeAway2": "How much if your private information is being sent to third parties.",
            "sessionKeyTakeAway3": "What APIs and workarounds can be done on Android to stop those trackers.",
            "sessionKeyTakeAway4": "You will realise that privacy doesn't have to come at a cost.",
            "sessionLevel": "20",
            "sessionSpeakerName": "David Gonzalez",
            "sessionTagMain": "Mobile",
            "sessionTags": [
                "Web",
                "Security"
            ],
            "sessionTitle": "A comprehensive guide to tracker protection on Android",
            "sessionTitleShort": "A comprehensive guide to tracker protection on Android",
            "sessionType": "40",
            "sessionURL": "a-comprehensive-guide-to-tracker-protection-on-android",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§SMpH8XCoBZXKY5f9n§4",
            "sessionScheduleRoom": "Wonderland",
            "sessionScheduleSlot": "4",
            "sessionSpeakerImagePuId": "2022_speakers/malmstein-gmail-com",
            "sessionSpeakerURL": "david-gonzalez",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "13:00:00"
        },
        {
            "_id": "MuNN3GDPHyv9mBwy2",
            "conferencename": "Øredev 2022",
            "sessionDescription": "People love to stay in their comfort zone and do what they've always done. But what if you could take your web applications to the next level just by getting the basics right?\n\nIn this .NET 6 demo-rich session, I will show you how to make your applications more testable, maintainable and resilient. \nWhether you are working with a monolith or a vast distributed application, the areas we'll cover will be applicable. \nJoin me as we journey down the rabbit hole, covering the following topics and more:\n\n- Minimal APIs, top-level statements and good design practise\n- Dependency injection and inversion of control\n- HTTP clients and policies\n- Resiliency and circuit breakers with Polly\n- Discovery clients with Steeltoe OSS",
            "sessionKeyTakeAway1": "Some of the new .NET 6 features and how to better organise your project",
            "sessionKeyTakeAway2": "Dependency Injection and IoC",
            "sessionKeyTakeAway3": "Building more resilient and maintable applications using Polly and HttpClientFactory",
            "sessionKeyTakeAway4": "Scaling applications including Service Discovery",
            "sessionLevel": "20",
            "sessionSpeakerName": "Layla Porter",
            "sessionTagMain": ".NET",
            "sessionTags": [
                "Architecture"
            ],
            "sessionTitle": "Advanced Basics for ASP.NET Developers",
            "sessionType": "40",
            "sessionURL": "advanced-basics-for-asp-net-developers",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§LYCz3myi2sMKuztYB§4",
            "sessionScheduleRoom": "Wrong way",
            "sessionScheduleSlot": "4",
            "sessionSpeakerImagePuId": "2022_speakers/layla-porter-gmail-com",
            "sessionSpeakerURL": "layla-porter",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "13:00:00"
        },
        {
            "_id": "iRPK22GCEEJ5kaA5S",
            "conferencename": "Øredev 2022",
            "sessionDescription": "A presentation about testing for developers and everybody else working in IT. \n\nSecret number one: this session is less about testing as you would expect... \n\nSoftware Development is a complex thing. We are dealing with customers who do not exactly know what they want. We also have to deal with complexity, confusion, changes, new insights and half answers. This requires research and experiments to create valuable software. Since my first days in IT, over 20 years ago, I hear discussions about whether or not we need testers. Testing is boring! It is not creative and it doesn't add real value. Testing is always slow and expensive; testers are cynical people who deliver bad news and most of all they do their utmost to slow delivery. Also, there are stories on how test automation can replace the expensive testers in our projects. To CTO’s it sounds comforting that all these expensive resources can be replaced by automation, doesn’t it?\n\nIn agile and especially DevOps approaches the motto is: automated everything! Companies like Facebook claim they do not have testers at all. Microsoft only has SDET (software development engineers in Test), other companies are T-shaping developers to do the testing. New kid on the block is AI and machine learning, that will definitely replace testing I hear people claim. What is really happening globally? Do we no longer need testers? Can we actually automate everything? How can we make valuable software for our clients?\n\nIn this interactive session we will look at quality software, risks and value. We'll dive into biases and misunderstanding surrounding testing. Testing makes developers look good! And developers make testing easier. And that is why developers (read: everybody in IT) should understand what modern testing vcan look like and how it can be very valuable, fast and fun. Our cleints expect us to speed up and go faster. So how can we fine tune our work to make this expectation real? How can we deliver quality software fast? As a team we can do this, but only if we collaborate...\n\nIn this talk I will share my experience in collaborating with developers as a tester and working with development teams as an agile and quality coach. We'll explore and discuss testing. In my stories I will give examples of great collaboration in teams. I will explain the difference in mind sets and shine a light on topics such as: quality culture, unit testing, pairing, automation, test strategy and testability. Stories that inspired others to up their game and experiment with new ways of working. Working together to create valuable software for our clients!\n\nIn this presentation I will address questions like:\n* How can we create quality software fast?\n* Do we need testing? And if so: why is testing important? \n* Can developers also test? And if so: do we still need testers?\n* What does effective testing in modern times require from your teams?",
            "sessionKeyTakeAway1": "How can we create quality software fast?",
            "sessionKeyTakeAway2": "How can your team manage risks and value?",
            "sessionKeyTakeAway3": "Do we need testing? And if so: why is testing important in modern times?",
            "sessionKeyTakeAway4": "How great collaboration in teams and new ways of working create valuable software for our clients!",
            "sessionLevel": "10",
            "sessionSpeakerName": "Huib Schoots",
            "sessionTagMain": "Quality & Test",
            "sessionTags": [
                "People & Teams",
                "DevOps"
            ],
            "sessionTitle": "Testing in modern times: A story about quality and value",
            "sessionTitleShort": "Testing in modern times",
            "sessionType": "40",
            "sessionURL": "testing-in-modern-times-a-story-about-quality-and-value",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§mLsppTucSgZEvLukS§5",
            "sessionScheduleRoom": "Downstairs",
            "sessionScheduleSlot": "5",
            "sessionSpeakerImagePuId": "2022_speakers/huib-qualityaccelerators-nl",
            "sessionSpeakerURL": "huib-schoots",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "14:00:00"
        },
        {
            "_id": "SkhbsqTa6FAMiHFti",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Modern apps are distributed, interconnected, and in the cloud, delivered by\ninterdependent teams. In two words: insanely complex. And they are getting \ntrickier to manage. Major risks don't even depend on the people who build the\napps, but on service providers, platforms and collaborating APIs.\n\nTo control this crazy complexity effectively, we need to establish effective\nfeedback loops. However, with complex interdependent adaptive platforms and\norganisations, feedback systems can be counterintuitive and confusing. People\noften measure the wrong things, act on feedback too soon or too late, and \nwaste time following the wrong signals.\n\nIn this talk, you'll learn about how to set up proper feedback loops, ensure\nthat you're measuring the right things at the right time, and look at the\nscience behind feedback to help you benefit from feedback loops\nmuch more effectively.",
            "sessionKeyTakeAway1": "How to make sure we're measuring the right things in devops, testing and software delivery",
            "sessionKeyTakeAway2": "How to manage and control stuff that's very difficult to grasp and predict",
            "sessionKeyTakeAway3": "How to spot common problems with feedback systems and fix them",
            "sessionKeyTakeAway4": "How to mix observability with testing to control unknown unknowns and third-party risks in the cloud",
            "sessionLevel": "20",
            "sessionSpeakerName": "Gojko Adzic",
            "sessionTagMain": "Quality & Test",
            "sessionTags": [
                "Cloud",
                "DevOps"
            ],
            "sessionTitle": "How to control insanely complex stuff in a simple way",
            "sessionTitleShort": "Control complex stuff with simple ideas",
            "sessionType": "40",
            "sessionURL": "how-to-control-insanely-complex-stuff-in-a-simple-way",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§Z569Ch8xnaEsMZjir§5",
            "sessionScheduleRoom": "Nowhere",
            "sessionScheduleSlot": "5",
            "sessionSpeakerImagePuId": "2022_speakers/gojko-neuri-co-uk",
            "sessionSpeakerURL": "gojko-adzic",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "14:00:00"
        },
        {
            "_id": "ApaeFr8cajLA63xej",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Let’s imagine you are part of a small team of four software engineers who work from home. You meet every day at 9am in your Zoom team room. After some small talk with your obligatory coffee, you pick the most important story, discuss it together, and then start implementing it. One person shares the screen acting as the typist while the others discuss on how to implement it and give instructions to the typist. After 10 minutes, the typist hands over their current work to the next typist. Rinse and repeat until the story is done, on which you pick the next most important story. At 5pm, you stop, reflect, and call it a day. Sounds crazy? I did this for over three years. And I don’t want to work differently anymore. In this talk, I want to share with you our story. I want to share with you how we worked together and what were the consequences for us. In short, I want to share with you how we grew together over distance. But let me put out a word of warning here: after having tasted this way of working, you might never be able to go back.",
            "sessionKeyTakeAway1": "You’ll learn how a team did full-time remote ensemble programming (aka mob programming)",
            "sessionKeyTakeAway2": "You’ll learn what the consequences of full-time remote ensemble programming are",
            "sessionKeyTakeAway3": "You can’t avoid learning some tips for remote work and remote meetings along the way",
            "sessionLevel": "10",
            "sessionSpeakerName": "Simon Harrer",
            "sessionTagMain": "People & Teams",
            "sessionTags": [
                "People & Teams"
            ],
            "sessionTitle": "Grow Together Over Distance",
            "sessionType": "40",
            "sessionURL": "grow-together-over-distance",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§eWnqdASsnFYcsWrZC§5",
            "sessionScheduleRoom": "Somewhere",
            "sessionScheduleSlot": "5",
            "sessionTitleShort": "A story of 3 years of full-time remote ensemble programming",
            "sessionSpeakerImagePuId": "2022_speakers/simon-harrer-innoq-com",
            "sessionSpeakerURL": "simon-harrer",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "14:00:00"
        },
        {
            "_id": "QQeHujqRxTpLJJFFc",
            "sessionTitle": "Coding Complex App Logic, Visually",
            "sessionLevel": "20",
            "sessionType": "40",
            "sessionTagMain": "Web",
            "sessionKeyTakeAway1": "You will learn how to manage complex app logic with state machines",
            "sessionKeyTakeAway2": "You will learn about statecharts and the actor model for orchestration",
            "sessionKeyTakeAway3": "You will be able to visualize your app logic in real-time and share it with your entire team",
            "sessionKeyTakeAway4": "You will be equipped to start using state machines and statecharts in your apps with intuitive visual tools and open-source libraries",
            "sessionDescription": "What if you could code without coding? As the number of features and requirements increase in our apps, text-based logic becomes much more complex to understand, change, and test. Using visual event-driven state modeling with state machines and statecharts orchestrates this logic in a simpler way. In this talk, you will learn about new tools and techniques for managing and editing complex logic visually, and how XState can bring your app logic to the next level.",
            "conferencename": "Øredev 2022",
            "sessionURL": "coding-complex-app-logic-visually",
            "sessionSpeakerName": "David Khourshid",
            "sessionSpeakersOther": [],
            "sessionTags": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§AgyfqDGL2sPCs4Ycj§5",
            "sessionScheduleRoom": "This way",
            "sessionScheduleSlot": "5",
            "sessionSpeakerImagePuId": "2022_speakers/davidkpiano-gmail-com",
            "sessionSpeakerURL": "david-khourshid",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "14:00:00"
        },
        {
            "_id": "bAyxRadCCSXyDfBBR",
            "conferencename": "Øredev 2022",
            "sessionDescription": "With a platform team of over a hundred backend and systems developers and only a handful of frontend devs, our design system was born out of necessity. We needed to enable everyone across our team to build the user interfaces that they envisioned without needing to filter through those with frontend expertise. Implementing a design system has allowed us to decentralize design and frontend development, enabling each fullstack scrum team to own their UI execution. This talk will tell about how we created our system — from concept to code to production — and what tools we used along the way.",
            "sessionKeyTakeAway1": "Why we chose to create a design system to enable devs with limited frontend experience.",
            "sessionKeyTakeAway2": "How our team created our system incrementally from an existing codebase.",
            "sessionKeyTakeAway3": "Which tools bridge the gap between design and engineering during development.",
            "sessionKeyTakeAway4": "What pitfalls to avoid when starting your own.",
            "sessionLevel": "20",
            "sessionSpeakerName": "Maryann Bell",
            "sessionTagMain": "Web",
            "sessionTags": [],
            "sessionTitle": "From Gatekeepers to Gardeners: Design Systems for Every Developer",
            "sessionTitleShort": "From Gatekeepers to Gardeners",
            "sessionType": "40",
            "sessionURL": "from-gatekeepers-to-gardeners-design-systems-for-every-developer",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§fcC2ASEZqJbm2mzhT§5",
            "sessionScheduleRoom": "Upstairs",
            "sessionScheduleSlot": "5",
            "sessionSpeakerImagePuId": "2022_speakers/maremarebell-gmail-com",
            "sessionSpeakerURL": "maryann-bell",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "14:00:00"
        },
        {
            "_id": "zMYDFZNz226sp7jiE",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Trying to modernize an older system can be a daunting task. Stakeholders are often tempted to favor the Big Bang rewrite, which means reconstructing the whole application with new technology. Just develop a whole new system, shut down the old one and boot up the new - how hard can it be? Well, the number of failing rewrite projects time and again proves this to be a risky approach - which in worst case leaves the business with no delivered value at all - before the budget runs out.\n\nThe Strangler Fig pattern offers an incremental, reliable process for refactoring code. It describes a method whereby a new system slowly grows over top of an old system until the old system is “strangled” and can simply be removed. But how can you accomplish this with an older ASP.NET based solution?\n\nIn this session we will investigate the Strangler Fig pattern in depth and see how we can use it to migrate parts of older ASP.NET WebForms or MVC applications to ASP.NET Core, with the help of Microsoft YARP (Yet Another Reverse Proxy).",
            "sessionKeyTakeAway1": "How the Strangler Fig pattern offers an alternative approach to the Big Bang system rewrite",
            "sessionKeyTakeAway2": "How to think about your older ASP.NET WebForms or MVC applications in terms of modernization",
            "sessionKeyTakeAway3": "Why the Microsoft YARP (Yet Another Reverse Proxy) is your friend",
            "sessionKeyTakeAway4": "Lessons learned from similar projects in the wild",
            "sessionLevel": "20",
            "sessionSpeakerName": "Robert Folkesson",
            "sessionTagMain": ".NET",
            "sessionTags": [
                "Web",
                "Architecture"
            ],
            "sessionTitle": "Modernize your ASP.NET based systems using the Strangler Fig pattern",
            "sessionTitleShort": "Modernize ASP.NET with the Strangler Fig pattern",
            "sessionType": "40",
            "sessionURL": "modernize-your-asp-net-based-systems-using-the-strangler-fig-pattern",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§SMpH8XCoBZXKY5f9n§5",
            "sessionScheduleRoom": "Wonderland",
            "sessionScheduleSlot": "5",
            "sessionSpeakerImagePuId": "2022_speakers/robert-folkesson-activesolution-se",
            "sessionSpeakerURL": "robert-folkesson",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "14:00:00"
        },
        {
            "_id": "nygzu8EgZaEG2icpp",
            "conferencename": "Øredev 2022",
            "sessionDescription": "During this session I will demonstrate how to build a fullstack web application using MongoDB Atlas App services. The MongoDB Atlas App services is a full stop shop for supporting your next application with database, RESTful and GraphQL APIs, ChangeStreams, Authentication and hosting. MongoDB Atlas App services allow developers to be developers and focus on building great software.",
            "sessionKeyTakeAway1": "Build a fullstack app using serverless technology from MongoDB",
            "sessionKeyTakeAway2": "Skip the hassle of hosting and maintaining a backend for your next project",
            "sessionLevel": "20",
            "sessionSpeakerName": "Emil Nildersen",
            "sessionTagMain": "Web",
            "sessionTags": [
                "Cloud",
                "Architecture"
            ],
            "sessionTitle": "Going serverless with MongoDB",
            "sessionTitleShort": "Going serverless with MongoDB",
            "sessionType": "40",
            "sessionURL": "going-serverless-with-mongodb",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§LYCz3myi2sMKuztYB§5",
            "sessionScheduleRoom": "Wrong way",
            "sessionScheduleSlot": "5",
            "sessionSpeakerImagePuId": "2022_speakers/emil-nildersen-mongodb-com",
            "sessionSpeakerURL": "emil-nildersen",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "14:00:00"
        },
        {
            "_id": "RR6ZJdBmD6JGPL8mn",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Data visualisation is everywhere, particularly for developers. Whether you're building user-facing dashboards into products, pitching new projects, presenting data analysis, reporting on progress, or pushing digital transformation programmes – you need to turn complex data sets into understandable and actionable communications. In this session we'll look at repeatable and practical techniques for telling compelling stories with data. We'll discuss the problems that often occur, and how to solve them. And we'll look at practical approaches for dealing with the most difficult part of any type of communication: human beings.",
            "sessionKeyTakeAway1": "How to plan a successful data visualisation",
            "sessionKeyTakeAway2": "Which visual approach to take in different contexts",
            "sessionKeyTakeAway3": "How to tailor visuals to different audiences",
            "sessionKeyTakeAway4": "Common data viz challenges, and how to overcome them",
            "sessionLevel": "10",
            "sessionSpeakerName": "Alan Rutter",
            "sessionTagMain": "Data Science",
            "sessionTags": [],
            "sessionTitle": "Data visualization for humans",
            "sessionTitleShort": "Data visualization for humans",
            "sessionType": "40",
            "sessionURL": "data-visualization-for-humans",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§mLsppTucSgZEvLukS§6",
            "sessionScheduleRoom": "Downstairs",
            "sessionScheduleSlot": "6",
            "sessionSpeakerImagePuId": "2022_speakers/alan-fireplusalgebra-com",
            "sessionSpeakerURL": "alan-rutter",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "15:20:00"
        },
        {
            "_id": "jiJWvcjb8Z6vQuNMJ",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Are there special ways to lead a group where everyone needs, and should,\nthink for themselves? How do you handle a constant inflow of ideas and\ndiffering work patterns? What about stress? And what has a character from\na children’s book got to do with it?\n\nMaking intelligent people work together is difficult, which is why it is\nfun. This will be a talk about leadership and intelligence, about teams\nand individuals, and also about some stupid things that intelligent\npeople do.",
            "sessionKeyTakeAway1": "How to lead and work with people that want to think for themselves",
            "sessionKeyTakeAway2": "Experiences from leading Mensa Sweden",
            "sessionLevel": "10",
            "sessionSpeakerName": "Monika Orski",
            "sessionTagMain": "People & Teams",
            "sessionTags": [],
            "sessionTitle": "Herding Cats – to lead and work with intelligent people",
            "sessionType": "40",
            "sessionURL": "herding-cats-to-lead-and-work-with-intelligent-people",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§Z569Ch8xnaEsMZjir§6",
            "sessionScheduleRoom": "Nowhere",
            "sessionScheduleSlot": "6",
            "sessionSpeakerImagePuId": "2022_speakers/mo-orski-se",
            "sessionSpeakerURL": "monika-orski",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "15:20:00"
        },
        {
            "_id": "MNFHQGdgGcQngH7MY",
            "conferencename": "Øredev 2022",
            "sessionDescription": "There is no perfect state management tool, and they all become even less perfect when we need to work with asynchronous logic. Handling loading state, deduplicating requests, updating complex state on API calls - all these things make our local state bloated and unmanageable. In this talk, I will build a local state of Vue application step by step to demonstrate the problems and then we will look into possible solutions.",
            "sessionKeyTakeAway1": "You will learn the common pitfalls of local state management tools when working with async logc",
            "sessionKeyTakeAway2": "You will learn the idea of separating the state on local state and server cache",
            "sessionKeyTakeAway3": "You will be able to start using react-query/vue-query in your application",
            "sessionLevel": "20",
            "sessionSpeakerName": "Natalia Tepluhina",
            "sessionTagMain": "Web",
            "sessionTags": [],
            "sessionTitle": "Deep down the rabbit hole of state management and server cache",
            "sessionType": "40",
            "sessionURL": "deep-down-the-rabbit-hole-of-state-management-and-server-cache",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§eWnqdASsnFYcsWrZC§6",
            "sessionScheduleRoom": "Somewhere",
            "sessionScheduleSlot": "6",
            "sessionSpeakerImagePuId": "2022_speakers/tarya-se-gmail-com",
            "sessionSpeakerURL": "natalia-tepluhina",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "15:20:00"
        },
        {
            "_id": "DEXZubcijuGjws3bj",
            "conferencename": "Øredev 2022",
            "sessionDescription": "When the time comes to modernize older systems, it's important to design an architecture fully optimized for your domain and not just a rewrite of the old system. Domain-Driven Design can help in a number of practical ways. In this talk, you will see how Event Storming, Domain Message Flow Modelling, and Core Domain Charts guide you through the process of mapping the business, designing a domain-driven architecture, and focusing on high-value modernization opportunities.",
            "sessionKeyTakeAway1": "Understand the importance of business domains in software architecture",
            "sessionKeyTakeAway2": "Practical techniques for modelling domains and architecture",
            "sessionKeyTakeAway3": "DDD Patterns for sequencing and transitioning to modernized architecture",
            "sessionLevel": "20",
            "sessionSpeakerName": "Nick Tune",
            "sessionTagMain": "Architecture",
            "sessionTags": [],
            "sessionTitle": "Architecture Modernization with DDD",
            "sessionTitleShort": "Architecture Modernization with DDD",
            "sessionType": "40",
            "sessionURL": "architecture-modernization-with-ddd",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§AgyfqDGL2sPCs4Ycj§6",
            "sessionScheduleRoom": "This way",
            "sessionScheduleSlot": "6",
            "sessionSpeakerImagePuId": "2022_speakers/nick-ntcoding-co-uk",
            "sessionSpeakerURL": "nick-tune",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "15:20:00"
        },
        {
            "_id": "7yrgkoAECftypL4WD",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Non-deterministic builds caused by loosely defined dependencies can lead to test instabilities and make it impossible to recreate build artifacts after the fact, making it harder to troubleshoot builds across a large scale build infrastructure. Learn how we at Unity are using open source Renovate and extended it to be able to pin both internal and external dependencies for the Unity DOTS project, including an ecosystem consisting of 30+ packages, being tested on multiple platforms including Windows, Linux and Mac.",
            "sessionKeyTakeAway1": "The importance of dependency pinning to ensure reproducibility and stability of CI, in a setup with distributed repositories, e.g. packages or microservices",
            "sessionKeyTakeAway2": "How to adopt a specific open source tool like Renovate into your organization to solve this",
            "sessionKeyTakeAway3": "Unity’s approach and learnings from solving these hard problems related to dependency management",
            "sessionLevel": "20",
            "sessionSpeakerName": "Rasmus Selsmark",
            "sessionTagMain": "Quality & Test",
            "sessionTags": [
                "Architecture",
                "DevOps"
            ],
            "sessionTitle": "Let's pin that dependency 📌",
            "sessionType": "40",
            "sessionURL": "let-s-pin-that-dependency-",
            "sessionSpeakersOther": [
                "cKyPLzbZcjDHocWHq"
            ],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§fcC2ASEZqJbm2mzhT§6",
            "sessionScheduleRoom": "Upstairs",
            "sessionScheduleSlot": "6",
            "sessionSpeakerImagePuId": "2022_speakers/rasmus-unity3d-com",
            "sessionSpeakerURL": "rasmus-selsmark",
            "otherSpeakersShow": [
                {
                    "_id": "cKyPLzbZcjDHocWHq",
                    "speakerFirstName": "Darío",
                    "speakerLastName": "Cutillas Carrillo",
                    "speakerURL": "dar-o-cutillas-carrillo",
                    "speakerImagePuId": "2022_speakers/dario-cutillas-unity3d-com"
                }
            ],
            "sessionScheduleTime": "15:20:00"
        },
        {
            "_id": "yL2W6R74yKEKw86qJ",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Learn how to create an API ready for production in very little time using FastAPI... explained with memes.\n\nYour API will have automatic validation, documentation based on standards, high performance, and several other features.\n\nAll this, having editor support including autocompletion everywhere.\n\nIn this talk you will learn what FastAPI can do, and how it could benefit you.\n\nYou will see how to declare the data you want to receive in each request using standard Python type annotations. Including path parameters, query parameters, body payloads with JSON, etc.\n\nYou will also see how to use simple, standard, Python type annotations to declare complex JSON body payloads with deeply nested structures, and get automatic data validation, serialization, and documentation.",
            "sessionKeyTakeAway1": "You will learn how Python type annotations can improve code quality and reduce bugs",
            "sessionKeyTakeAway2": "I will show you how to use FastAPI to build APIs with best practices by default",
            "sessionKeyTakeAway3": "You will learn how to create APIs with path parameters, query parameters, JSON bodies, and more",
            "sessionKeyTakeAway4": "You will understand how FastAPI uses the standard Python type annotations to do data validation, serialization, documentation, and how you get an automatic, interactive, documentation API user interface",
            "sessionLevel": "10",
            "sessionSpeakerName": "Sebastián Ramírez",
            "sessionTagMain": "Polyglot & Fringe",
            "sessionTags": [
                "Web",
                "Cloud",
                "Architecture",
                "Data Science",
                "Quality & Test",
                "Security"
            ],
            "sessionTitle": "Intro to FastAPI",
            "sessionType": "40",
            "sessionURL": "intro-to-fastapi",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§SMpH8XCoBZXKY5f9n§6",
            "sessionScheduleRoom": "Wonderland",
            "sessionScheduleSlot": "6",
            "sessionSpeakerImagePuId": "2022_speakers/tiangolo-gmail-com",
            "sessionSpeakerURL": "sebasti-n-ram-rez",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "15:20:00"
        },
        {
            "_id": "wkag2eEQFCejYd68T",
            "conferencename": "Øredev 2022",
            "sessionDescription": "This session starts in 1985 when I was 7 years old.\nI got my first computer, a Sinclair ZX Spectrum.\nI still remember that the first thing I did was to sit down and write:\n10 PRINT \"Jimmy\"\n20 GOTO 10\nThis was my code, I made the machine do things!\nThis was the moment when I decided that I wanted to become a developer.\nMany different computers followed, ZX Spectrum+, Commodore 64, and Commodore Amiga 500, but the ZX Spectrum still has a very special place in my heart.\n\nOnce I became a developer I thought, -\"would it be possible to build an emulator?\" so I set out to build an emulator.\n\nIn this session, I will share that journey.\nWe will touch base on, registers, memory management, sound, handling input, and output.\n\nAll of this is in a Blazor WebAssembly application.",
            "sessionKeyTakeAway1": "You will learn the basics of building an emulator",
            "sessionKeyTakeAway2": "You will learn how computers from the 80's works",
            "sessionKeyTakeAway3": "Learn the basics how assembler works",
            "sessionLevel": "20",
            "sessionSpeakerName": "Jimmy Engström",
            "sessionTagMain": ".NET",
            "sessionTags": [
                "Web",
                "Entertainment"
            ],
            "sessionTitle": "How I built a ZX Spectrum emulator from scratch using C# and Blazor",
            "sessionTitleShort": "How I built a ZX Spectrum emulator",
            "sessionType": "40",
            "sessionURL": "how-i-built-a-zx-spectrum-emulator-from-scratch-using-c-and-blazor",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§LYCz3myi2sMKuztYB§6",
            "sessionScheduleRoom": "Wrong way",
            "sessionScheduleSlot": "6",
            "sessionSpeakerImagePuId": "2022_speakers/jimmy-apeoholic-se",
            "sessionSpeakerURL": "jimmy-engstr-m",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "15:20:00"
        },
        {
            "_id": "N2ufcfeKWuY2xQgAR",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Data is one of the most valuable assets to nowadays business. However, most of them are struggling to manage it with their applications.\n\nThere are dozens of concepts and variables around data management, which can get confusing. That's why, before exploring some of those key definitions, let’s bust some myths around data management:\n\n\"A data management plan or a strategy is only for big companies.\" – Wrong! The sooner you become aware of the importance of having organized, manageable, and integrated data, the better positioned your company will be. Startups and small teams can increase their productivity and improve their customer interactions by managing data properly.\n\n\"Managing data is for mathematicians and scientists\" – Definitely not. Though everyone is looking to hire Data Engineers and Data Scientists, the manual work involved and the real process of integrating data processes into applications often results in coding, architecting backend, and implementation of services.\n\n“You need to learn Python to tackle data management” - Not necessarily. There are many easy-to-use Ruby-based solutions that allow you to collect, store, maintain, process, and integrate your data.\n\nIn this topic I will cover more about What is Data Management, Data Management Goals, Best Practices and Ruby Based Solutions for that.",
            "sessionKeyTakeAway1": "We will give a definition of what is Data Management and review three basic stages that it encompass: collection, storing, and processing",
            "sessionKeyTakeAway2": "We will review real life examples of Enterprise Data Management Strategies and will learn how to build data processes aligned to your business objectives",
            "sessionKeyTakeAway3": "You will learn best practices and techniques for managing data from Ruby language point of view, including libraries, frameworks and read-to-go boiler-plates.",
            "sessionKeyTakeAway4": "Finally you will get a chance to look under the hood of working samples of Data Management concept in a real production project.",
            "sessionLevel": "30",
            "sessionSpeakerName": "Sergey Sergyenko",
            "sessionTagMain": "Data Science",
            "sessionTags": [
                "Architecture"
            ],
            "sessionTitle": "Data Management with Ruby: Goals, Best Practices and Ruby Based Solutions",
            "sessionTitleShort": "Data Management with Ruby",
            "sessionType": "40",
            "sessionURL": "data-management-with-ruby-goals-best-practices-and-ruby-based-solutions",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§mLsppTucSgZEvLukS§7",
            "sessionScheduleRoom": "Downstairs",
            "sessionScheduleSlot": "7",
            "sessionSpeakerImagePuId": "2022_speakers/sergy-cybergizer-eu",
            "sessionSpeakerURL": "sergey-sergyenko",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "16:20:00"
        },
        {
            "_id": "o4E3ZfohogAjg6Jbn",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Are there 10x engineers? Unclear. But there are 1000x companies for sure. If we look at value delivery metrics, we can find spans of 1000x between leaders and companies lagging behind. The DORA research effort showed a 1000x span in availability metrics (see the State of DevOps report). Lego once built a virtual reality game, \"Lego Universe\", comparable to Minecraft. They spent 10000x the cost before the game launch, compared to Mojang. \n\nWe see similar huge efficiency spans in ability to extract value from data. Most data processing involves creation of datasets - refined data artifacts of business value, e.g. reports, recommendation indexes, or machine learning models. Mature companies with large traditional data warehouses typically create on the order of 100s of datasets per day. Google produces billions of datasets per day (Goods paper, 2016). Spotify shows more modest figures, only hundreds of thousands (deduced from conference presentations 2018), but still 1000x more than a typical enterprise.\n\nHow do they achieve this level of data efficiency? We have spent time with companies at both ends of the spectrum and seen patterns emerge. In this presentation, we will highlight the differences with seven patterns that seem to be crucial for data efficiency. We have also figured out how to achieve a comparable level of efficiency at a small scale, without huge investments, and will share our tricks of the trade.",
            "sessionKeyTakeAway1": "How difference in data efficiency can be disruptive at a business level",
            "sessionKeyTakeAway2": "What the leading data companies are doing differently",
            "sessionKeyTakeAway3": "How to achieve leader level data efficiency with minimal effort",
            "sessionLevel": "20",
            "sessionSpeakerName": "Lars Albertsson",
            "sessionTagMain": "Data Science",
            "sessionTags": [
                "Architecture",
                "People & Teams"
            ],
            "sessionTitle": "The 7 habits of data effective companies",
            "sessionTitleShort": "The 7 habits of data effective companies",
            "sessionType": "40",
            "sessionURL": "the-7-habits-of-data-effective-companies",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§Z569Ch8xnaEsMZjir§7",
            "sessionScheduleRoom": "Nowhere",
            "sessionScheduleSlot": "7",
            "sessionSpeakerImagePuId": "2022_speakers/lalle-scling-com",
            "sessionSpeakerURL": "lars-albertsson",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "16:20:00"
        },
        {
            "_id": "T3scrYtKDe5LaS6XY",
            "conferencename": "Øredev 2022",
            "sessionDescription": "In the gaming industry, your users are both looking for a great experience and for ways to break what you give them.\nHow can we work towards giving them the former while still not making it possible for them to do the latter?\nEvery player has their own way of playing the game, and we need to represent that in the QA team as much as we can. Both in terms of the humans involved as well as the hardware and equipment that we use. \nIt is important to understand the player's issues and also to ignore the haters, and I will show some examples of how to manage this. \nJoin me on a journey of learning that what you thought was important in reality was not and that being right isn't always that much fun.",
            "sessionKeyTakeAway1": "The importance of checking in with your users to understand their needs and wants.",
            "sessionKeyTakeAway2": "Ways to bring the versatility of the users into the QA process.",
            "sessionKeyTakeAway3": "What it is like and why it is so fun to work in gaming.",
            "sessionLevel": "10",
            "sessionSpeakerName": "Carin Cedergren",
            "sessionSpeakersOther": [],
            "sessionTagMain": "Quality & Test",
            "sessionTags": [],
            "sessionTitle": "How to game your testing game in the gaming industry",
            "sessionType": "40",
            "sessionURL": "how-to-game-your-testing-game-in-the-gaming-industry",
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§eWnqdASsnFYcsWrZC§7",
            "sessionScheduleRoom": "Somewhere",
            "sessionScheduleSlot": "7",
            "sessionSpeakerImagePuId": "2022_speakers/carincedergren-gmail-com",
            "sessionSpeakerURL": "carin-cedergren",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "16:20:00"
        },
        {
            "_id": "EP4FRBhuMox6uFY2p",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Despite being the only section of a website that a user never sees, the HEAD is arguably the most important. It is bound to its own unique set of rules and often governs the overall speed of the page. In this talk, we’ll look at some specific caveats, some fascinating intricacies, and—critically—the optimum order for a faster HEAD. Find out why your HEAD tags are so messy, so vital, and, I promise you, so interesting.",
            "sessionKeyTakeAway1": "Why HEAD tags are so important",
            "sessionKeyTakeAway2": "What the perfect order of your HEAD tags should be",
            "sessionKeyTakeAway3": "How this order helps or hinders performance",
            "sessionKeyTakeAway4": "How to audit HEAD tags very quickly",
            "sessionLevel": "20",
            "sessionSpeakerName": "Harry Roberts",
            "sessionTagMain": "Web",
            "sessionTags": [],
            "sessionTitle": "Get Your Head Straight",
            "sessionType": "40",
            "sessionURL": "get-your-head-straight",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§AgyfqDGL2sPCs4Ycj§7",
            "sessionScheduleRoom": "This way",
            "sessionScheduleSlot": "7",
            "sessionSpeakerImagePuId": "2022_speakers/csswizardry-gmail-com",
            "sessionSpeakerURL": "harry-roberts",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "16:20:00"
        },
        {
            "_id": "TKLBwh3kttRZhgTpf",
            "conferencename": "Øredev 2022",
            "sessionDescription": "This session will give you a good overview of the React Native landscape. You will learn more about the new React Native architecture (the Fabric Renderer and the TurboModule system, available from April / May 2022). How is this better than the previous one? What will this new  architecture enable? You will also see how you can build Mobile and webapp with the same codebase and improved developer experience and  without compromising on user experience",
            "sessionKeyTakeAway1": "You will get a good understanding how React-Native works",
            "sessionKeyTakeAway2": "You will see examples of how you can write code once and run it on iOS, Android and the browser",
            "sessionKeyTakeAway3": "You will see some good uses cases for React-Native",
            "sessionLevel": "20",
            "sessionSpeakerName": "Truls Skeie",
            "sessionTagMain": "Mobile",
            "sessionTags": [],
            "sessionTitle": "React Native in 40 minutes",
            "sessionTitleShort": "An intermediate intro to React-Native.",
            "sessionType": "40",
            "sessionURL": "react-native-in-40-minutes",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§fcC2ASEZqJbm2mzhT§7",
            "sessionScheduleRoom": "Upstairs",
            "sessionScheduleSlot": "7",
            "sessionSpeakerImagePuId": "2022_speakers/trulsske-gmail-com",
            "sessionSpeakerURL": "truls-skeie",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "16:20:00"
        },
        {
            "_id": "dno5kvGxLAw2rNu8C",
            "conferencename": "Øredev 2022",
            "sessionDescription": "A modern mindfulness approach is well suited for people like us, people in tech. Most of us like to build and tinker with technical and social systems. Similarly, modern mindfulness is a tool to systematically tinker with one of the most fascinating systems that exist - your mind.\n\nModern mindfulness will have a similar impact on our way of working and living as Agile has had in the past 20 years. With a modern understanding and practice of mindfulness, it becomes a useful addition to the many organizational practices we already employ.",
            "sessionKeyTakeAway1": "You will get a fresh view on what mindfulness is and what it is about, so that you can make a choice about incorporating it into your life.",
            "sessionKeyTakeAway2": "Mindfulness is often misunderstood as either something esoteric or seen as just being about mental health. That misses its true potential.",
            "sessionKeyTakeAway3": "The connection between mindfulness, agile and modern knowledge work will become clear.",
            "sessionKeyTakeAway4": "We will also practice for a few minutes, therefore you gain a first experience of a modern mindfulness approach.",
            "sessionLevel": "20",
            "sessionSpeakerName": "Markus Wittwer",
            "sessionTagMain": "People & Teams",
            "sessionTags": [],
            "sessionTitle": "Mindfulness for people like us",
            "sessionTitleShort": "Mindfulness for people like us",
            "sessionType": "40",
            "sessionURL": "mindfulness-for-people-like-us",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§SMpH8XCoBZXKY5f9n§7",
            "sessionScheduleRoom": "Wonderland",
            "sessionScheduleSlot": "7",
            "sessionSpeakerImagePuId": "2022_speakers/info-markuswittwer-de",
            "sessionSpeakerURL": "markus-wittwer",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "16:20:00"
        },
        {
            "_id": "mrNyTB4EPjiWTDEkC",
            "sessionTitle": "Principles for Designing and Deploying Scalable and Secure Applications on Kubernetes",
            "sessionTitleShort": "Principles for Kubernetes Application DevOps",
            "sessionLevel": "20",
            "sessionType": "40",
            "sessionTagMain": "DevOps",
            "sessionTags": [
                "Cloud",
                "Security"
            ],
            "sessionKeyTakeAway1": "How to work with the Kubernetes platform, enabling predictable automation for your application.",
            "sessionKeyTakeAway2": "How to activate security features in the Kubernetes platform, protecting your application and other deployments.",
            "sessionKeyTakeAway3": "How to handle software failure gracefully and correctly, making it possible to recover from errors.",
            "sessionDescription": "Kubernetes and containerization have revolutionized how we deploy applications. Both are easy to get started with, but offer significant depth to advanced users. In this talk, Lars Larsson from Elastisys, offers his insight in how we can design and deploy applications specifically to benefit from advanced features of the Kubernetes platform. By following the principles of this talk, your applications will be more robust, easy to automate, designed for handling failure, be observable, and have a greatly reduced attack surface.",
            "conferencename": "Øredev 2022",
            "sessionURL": "principles-for-designing-and-deploying-scalable-and-secure-applications-on-kubernetes",
            "sessionSpeakerName": "Lars Larsson",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§LYCz3myi2sMKuztYB§7",
            "sessionScheduleRoom": "Wrong way",
            "sessionScheduleSlot": "7",
            "sessionSpeakerImagePuId": "2022_speakers/lars-larsson-elastisys-com",
            "sessionSpeakerURL": "lars-larsson",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "16:20:00"
        },
        {
            "_id": "ajycqbfYxbdg5XDNy",
            "conferencename": "Øredev 2022",
            "sessionDescription": "The lecture will look at the question of how technology is contributing to the feelings of apathy today and what kind of emotions are at work when we fall into the internet's rabbit hole.",
            "sessionKeyTakeAway1": "Audience will get the understanding what is happening psychologicaly in our technologically advanced societies.",
            "sessionKeyTakeAway2": "Yes - you will understand why people spread fake news and why psychological gains they get from angry responses.",
            "sessionKeyTakeAway3": "Yes, you will understand the power of the algorithms to push us into the rabbit hole of dissatisfaction.",
            "sessionKeyTakeAway4": "You will better understand what needs to change in the online workd for people having better mental health experience.",
            "sessionLevel": "30",
            "sessionSpeakerName": "Renata Salecl",
            "sessionTagMain": "Keynote",
            "sessionTags": [],
            "sessionTitle": "Apathy in the online world",
            "sessionTitleShort": "Why are we falling into the internet's rabbit hole of dissatisfaction?",
            "sessionType": "40",
            "sessionURL": "apathy-in-the-online-world",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "2",
            "sessionScheduleId": "§Q5NEpFJGgiEdMZaYf§SMpH8XCoBZXKY5f9n§8",
            "sessionScheduleRoom": "Wonderland",
            "sessionScheduleSlot": "8",
            "sessionSpeakerImagePuId": "2022_speakers/rs18-hotmail-com",
            "sessionSpeakerURL": "renata-salecl",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "17:30:00"
        },
        {
            "_id": "koTyA7GovpDcuynLb",
            "conferencename": "Øredev 2022",
            "sessionDescription": "\"Why, sometimes I've believed as many as six impossible things before breakfast.\" ...\n\nWhy are the majority of attacks and breaches still caused by human error or manipulation?  Why do people still fall for phishing emails, bogus social media approaches and impersonation attacks? Why, after all efforts at education, do people still believe six impossible things before breakfast?\n\nIn this talk world reknowned social engineer and \"people hacker\" will talk about the role of social engineering in scams, cons and fraud.  She will link the psychology of social engineering with real world examples of scams and discuss how in spite of our own doubts, anyone can still be a victim to malicious actors seeking to manipulate us for criminal gain.  She'll discuss the \"red flags\" to look out for in order to identify suspicious approaches via a variety of different methods and discuss some case studies of recent scams and cons to illustrate her points.  This talk is both an explanation of the psychology at play in malicious social engineering, and a call to action with the tools and practical steps we can all take to help mitigate and prevent it.\n\n\n\"Why, sometimes I've believed as many as six impossible things before breakfast.\" ...\n\nWhy are the majority of attacks and breaches still caused by human error or manipulation?  Why do people still fall for phishing emails, bogus social media approaches and impersonation attacks? Why, after all efforts at education, do people still believe six impossible things before breakfast?\n\nIn this talk world reknowned social engineer and \"people hacker\" will talk about the role of social engineering in scams, cons and fraud.  She will link the psychology of social engineering with real world examples of scams and discuss how in spite of our own doubts, anyone can still be a victim to malicious actors seeking to manipulate us for criminal gain.  She'll discuss the \"red flags\" to look out for in order to identify suspicious approaches via a variety of different methods and discuss some case studies of recent scams and cons to illustrate her points.  This talk is both an explanation of the psychology at play in malicious social engineering, and a call to action with the tools and practical steps we can all take to help mitigate and prevent it.\n\n\n\"Why, sometimes I've believed as many as six impossible things before breakfast.\" ...\n\nWhy are the majority of attacks and breaches still caused by human error or manipulation?  Why do people still fall for phishing emails, bogus social media approaches and impersonation attacks? Why, after all efforts at education, do people still believe six impossible things before breakfast?\n\nIn this talk world reknowned social engineer and \"people hacker\" will talk about the role of social engineering in scams, cons and fraud.  She will link the psychology of social engineering with real world examples of scams and discuss how in spite of our own doubts, anyone can still be a victim to malicious actors seeking to manipulate us for criminal gain.  She'll discuss the \"red flags\" to look out for in order to identify suspicious approaches via a variety of different methods and discuss some case studies of recent scams and cons to illustrate her points.  This talk is both an explanation of the psychology at play in malicious social engineering, and a call to action with the tools and practical steps we can all take to help mitigate and prevent it.\n\n\n\"Why, sometimes I've believed as many as six impossible things before breakfast.\" ...\n\nWhy are the majority of attacks and breaches still caused by human error or manipulation?  Why do people still fall for phishing emails, bogus social media approaches and impersonation attacks? Why, after all efforts at education, do people still believe six impossible things before breakfast?\n\nIn this talk world reknowned social engineer and \"people hacker\" will talk about the role of social engineering in scams, cons and fraud.  She will link the psychology of social engineering with real world examples of scams and discuss how in spite of our own doubts, anyone can still be a victim to malicious actors seeking to manipulate us for criminal gain.  She'll discuss the \"red flags\" to look out for in order to identify suspicious approaches via a variety of different methods and discuss some case studies of recent scams and cons to illustrate her points.  This talk is both an explanation of the psychology at play in malicious social engineering, and a call to action with the tools and practical steps we can all take to help mitigate and prevent it.\n\n\n\"Why, sometimes I've believed as many as six impossible things before breakfast.\" ...\n\nWhy are the majority of attacks and breaches still caused by human error or manipulation?  Why do people still fall for phishing emails, bogus social media approaches and impersonation attacks? Why, after all efforts at education, do people still believe six impossible things before breakfast?\n\nIn this talk world reknowned social engineer and \"people hacker\" will talk about the role of social engineering in scams, cons and fraud.  She will link the psychology of social engineering with real world examples of scams and discuss how in spite of our own doubts, anyone can still be a victim to malicious actors seeking to manipulate us for criminal gain.  She'll discuss the \"red flags\" to look out for in order to identify suspicious approaches via a variety of different methods and discuss some case studies of recent scams and cons to illustrate her points.  This talk is both an explanation of the psychology at play in malicious social engineering, and a call to action with the tools and practical steps we can all take to help mitigate and prevent it.\n\n\"Why, sometimes I've believed as many as six impossible things before breakfast.\" ...\n\nWhy are the majority of attacks and breaches still caused by human error or manipulation?  Why do people still fall for phishing emails, bogus social media approaches and impersonation attacks? Why, after all efforts at education, do people still believe six impossible things before breakfast?\n\nIn this talk world reknowned social engineer and \"people hacker\" will talk about the role of social engineering in scams, cons and fraud.  She will link the psychology of social engineering with real world examples of scams and discuss how in spite of our own doubts, anyone can still be a victim to malicious actors seeking to manipulate us for criminal gain.  She'll discuss the \"red flags\" to look out for in order to identify suspicious approaches via a variety of different methods and discuss some case studies of recent scams and cons to illustrate her points.  This talk is both an explanation of the psychology at play in malicious social engineering, and a call to action with the tools and practical steps we can all take to help mitigate and prevent it.\n\n\"Why, sometimes I've believed as many as six impossible things before breakfast.\" ...\n\nWhy are the majority of attacks and breaches still caused by human error or manipulation?  Why do people still fall for phishing emails, bogus social media approaches and impersonation attacks? Why, after all efforts at education, do people still believe six impossible things before breakfast?\n\nIn this talk world reknowned social engineer and \"people hacker\" will talk about the role of social engineering in scams, cons and fraud.  She will link the psychology of social engineering with real world examples of scams and discuss how in spite of our own doubts, anyone can still be a victim to malicious actors seeking to manipulate us for criminal gain.  She'll discuss the \"red flags\" to look out for in order to identify suspicious approaches via a variety of different methods and discuss some case studies of recent scams and cons to illustrate her points.  This talk is both an explanation of the psychology at play in malicious social engineering, and a call to action with the tools and practical steps we can all take to help mitigate and prevent it.\n\"Why, sometimes I've believed as many as six impossible things before breakfast.\" ...\n\nWhy are the majority of attacks and breaches still caused by human error or manipulation?  Why do people still fall for phishing emails, bogus social media approaches and impersonation attacks? Why, after all efforts at education, do people still believe six impossible things before breakfast?\n\nIn this talk world reknowned social engineer and \"people hacker\" will talk about the role of social engineering in scams, cons and fraud.  She will link the psychology of social engineering with real world examples of scams and discuss how in spite of our own doubts, anyone can still be a victim to malicious actors seeking to manipulate us for criminal gain.  She'll discuss the \"red flags\" to look out for in order to identify suspicious approaches via a variety of different methods and discuss some case studies of recent scams and cons to illustrate her points.  This talk is both an explanation of the psychology at play in malicious social engineering, and a call to action with the tools and practical steps we can all take to help mitigate and prevent it.",
            "sessionKeyTakeAway1": "Psychology of social engineering",
            "sessionKeyTakeAway2": "How the mind can be manipulated to scam and con the humans",
            "sessionKeyTakeAway3": "Common tricks and techniques of social engineers",
            "sessionKeyTakeAway4": "red flags and how to avoid being a victim",
            "sessionLevel": "10",
            "sessionSpeakerName": "Jenny Radcliffe",
            "sessionTagMain": "Keynote",
            "sessionTags": [],
            "sessionTitle": "Sometimes I've believed as many as six impossible things before breakfast...",
            "sessionTitleShort": "The Psychology of Social Engineering",
            "sessionType": "40",
            "sessionURL": "sometimes-i-ve-believed-as-many-as-six-impossible-things-before-breakfast-",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§SMpH8XCoBZXKY5f9n§1",
            "sessionScheduleRoom": "Wonderland",
            "sessionScheduleSlot": "1",
            "sessionSpeakerImagePuId": "2022_speakers/jenny-jennyradcliffe-com",
            "sessionSpeakerURL": "jenny-radcliffe",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "09:00:00"
        },
        {
            "_id": "LbimShzbg6yk4gxTt",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Creating maintainable code is one of the corner stones in ensuring a projects or products success over time. Maintainable code also tends to be testable code, and having a strong test suite will allow you to iterate and add new features faster.\n\n- How do we apply best coding practices to Blazor components?\n- How do we make our Blazor components testable and be part of CI/CD?\n- How do we make our component's tests maintainable?\n\nThis talk will answer those questions, by taking you through the design and implementation of a dynamic data-table component. It will also introduce bUnit, a component-testing library for Blazor, that we will use to write maintainable tests for the data-table component.",
            "sessionKeyTakeAway1": "How to apply best coding practices to Blazor components.",
            "sessionKeyTakeAway2": "How to make our Blazor components testable and be part of CI/CD",
            "sessionKeyTakeAway3": "How do we make our component's tests maintainable",
            "sessionLevel": "20",
            "sessionSpeakerName": "Egil Hansen",
            "sessionTagMain": "Web",
            "sessionTags": [
                ".NET",
                "Quality & Test"
            ],
            "sessionTitle": "How to create maintainable and testable Blazor components",
            "sessionType": "40",
            "sessionURL": "how-to-create-maintainable-and-testable-blazor-components",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§mLsppTucSgZEvLukS§2",
            "sessionScheduleRoom": "Downstairs",
            "sessionScheduleSlot": "2",
            "sessionSpeakerImagePuId": "2022_speakers/egil-egilhansen-com",
            "sessionSpeakerURL": "egil-hansen",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "10:30:00"
        },
        {
            "_id": "Y4WMqoF2aJw4YoC3z",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Do you hear a rumor that SQL Server is dead? It is in the Cloud everything should happen.\nI have heard it too. But evidence points to the contrary. SQL Server on-premises installations are very much alive and kicking.\nIn this session I will give real-life scenarios where a cloud based database simply wouldn't have been accepted.",
            "sessionKeyTakeAway1": "Usability of SQL Server on-premises",
            "sessionKeyTakeAway2": "Tips and tricks on improving your database coding skills",
            "sessionKeyTakeAway3": "Real life usage of on-premises databases",
            "sessionLevel": "10",
            "sessionSpeakerName": "Mikael Wedham",
            "sessionTagMain": "Data Science",
            "sessionTags": [
                "Architecture",
                "Security"
            ],
            "sessionTitle": "SQL Server on-premises is not dead",
            "sessionTitleShort": "SQL Server on-premises is not dead",
            "sessionType": "40",
            "sessionURL": "sql-server-on-premises-is-not-dead",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§Z569Ch8xnaEsMZjir§2",
            "sessionScheduleRoom": "Nowhere",
            "sessionScheduleSlot": "2",
            "sessionSpeakerImagePuId": "2022_speakers/wedham-hotmail-com",
            "sessionSpeakerURL": "mikael-wedham",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "10:30:00"
        },
        {
            "_id": "L2NzciTu226gZu9La",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Remix is a new React-based JavaScript framework that supports server-side rendering. It comes from the team behind React Router and provides a fresh take on full-stack web app development. \n\nThis presentation will teach you how to get started with Remix and its ins and outs.\n\nI will present theories using slides, then start with live coding. So that audience will see how to develop a web app using Remix. I will begin with the Remix's setup and file structure, root route module, layout, links, metafunctions, file-based routing, nested routes, loaders, actions, database setup, HTTP requests, etc.",
            "sessionKeyTakeAway1": "you will learn what is Remix and how to use it",
            "sessionKeyTakeAway2": "you will learn what is prisma and how to use it",
            "sessionKeyTakeAway3": "you will learn why Remix is gaining popularity",
            "sessionKeyTakeAway4": "you will learn how to build a real-world application using Remix",
            "sessionLevel": "10",
            "sessionSpeakerName": "Devlin Duldulao",
            "sessionTagMain": "Web",
            "sessionTags": [],
            "sessionTitle": "Getting started with Remix, the hottest JavaScript framework as of today",
            "sessionTitleShort": "Remix in Action",
            "sessionType": "40",
            "sessionURL": "getting-started-with-remix-the-hottest-javascript-framework-as-of-today",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§eWnqdASsnFYcsWrZC§2",
            "sessionScheduleRoom": "Somewhere",
            "sessionScheduleSlot": "2",
            "sessionSpeakerImagePuId": "2022_speakers/webmasterdevlin-gmail-com",
            "sessionSpeakerURL": "devlin-duldulao",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "10:30:00"
        },
        {
            "_id": "QohHAH9HiWYPkb3Z3",
            "conferencename": "Øredev 2022",
            "sessionDescription": "The world of software testing is rife with myths about automation that have been with us for years. A quick internet search, however, shows that most of these myths have been debunked by multiple people in blogs, articles, conferences, and webinars. Many of the authors debunk a specific myth with similar logic and examples; this is good because it provides consistency for the “common case”. We easily can find debunking of myths ranging from “automation is best for regression testing” to “it’s feasible to automate everything”.\n\nBut do these “debunkings” hold true for all contexts? Is “Record and Playback” always a bad idea? Is partial automation at all valuable? Are technology and programming really the hard parts?\n\nJoin Paul Grizzaffi as he explores some of the classic myths, their debunking, and the myths about those myths, i.e., instances when a myth is not a myth if applied to a specific context.",
            "sessionKeyTakeAway1": "All decisions about test automation must be made with business value in mind.",
            "sessionKeyTakeAway2": "Some of the truisms in software development in general, and in test automation specifically, don't hold true in some contexts.",
            "sessionLevel": "20",
            "sessionSpeakerName": "Paul Grizzaffi",
            "sessionTagMain": "Quality & Test",
            "sessionTags": [
                "Architecture"
            ],
            "sessionTitle": "Myths About Myths About Automation",
            "sessionType": "40",
            "sessionURL": "myths-about-myths-about-automation",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§AgyfqDGL2sPCs4Ycj§2",
            "sessionScheduleRoom": "This way",
            "sessionScheduleSlot": "2",
            "sessionSpeakerImagePuId": "2022_speakers/paul-grizzaffi-yahoo-com",
            "sessionSpeakerURL": "paul-grizzaffi",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "10:30:00"
        },
        {
            "_id": "yfRxrHDJjym2kAfGM",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Nearly 3 years since the inception many of us have seen amazing demos: How fast Quarkus based applications start, how helpful dev mode is, we have even learned continuous testing. And when going to production, it even works natively on GraalVM.\n\nThis talk is the story that starts after a small meeting back in early 2019 in London that led to making the Neo4j driver compatible with GraalVM native over to providing a Quarkus extensions for just the connectivity and eventually ending with full support of Neo4j-ObjectGraphMapping framework in Quarkus. \n\nWe will talk about the mechanisms Quarkus applies to create a closed world assumption that fulfills the needs of GraalVM native, how extensions need to deal with and the different modules being in a Quarkus extension.\n\nThis talk will help you understanding why things in Quarkus work the way they do and how you can benefit from them.\n\nAll of that will be demonstrated with Neo4j and the official Java connectivity to the worlds leading Graph database.",
            "sessionKeyTakeAway1": "Learn about GraalVM Native image in a practical example",
            "sessionKeyTakeAway2": "Learn about the different approaches for native image (Quarkus Buildtime, Spring Runtime)",
            "sessionLevel": "20",
            "sessionSpeakerName": "Michael Simons",
            "sessionTagMain": "JVM",
            "sessionTags": [],
            "sessionTitle": "Under the hoods: How Quarkus operates with GraalVM demonstrated with Neo4j",
            "sessionType": "40",
            "sessionURL": "under-the-hoods-how-quarkus-operates-with-graalvm-demonstrated-with-neo4j",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§fcC2ASEZqJbm2mzhT§2",
            "sessionScheduleRoom": "Upstairs",
            "sessionScheduleSlot": "2",
            "sessionKeyTakeAway3": "Learn to utilise Quarkus Dev-Mode",
            "sessionSpeakerImagePuId": "2022_speakers/michael-simons-neo4j-com",
            "sessionSpeakerURL": "michael-simons",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "10:30:00"
        },
        {
            "_id": "aknpmWEJ67KQQGhXj",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Agile has lost its shine, \"corporate agile\" has stripped away all the fun, passion, excitement and learning. Adding OKRs just makes it worse: a reinvention of top-down management by objective with added metrics to mislead and distort reality. Such OKRs are little more than a return of return to command and control.\n\nThats what this former OKR cynic thought, but after using OKRs with multiple teams he got a surprise: they work. Used right OKRs fit well with agile.\n\nOKRs offer the tantalising prospect of reawakening agile's radical side, aligning management with teams, improving communication and resolving the tyranny of the backlog.",
            "sessionKeyTakeAway1": "A smile, a laugh, a couple of jokes to share",
            "sessionKeyTakeAway2": "How corporate agile emphasises E over R",
            "sessionKeyTakeAway3": "How OKRs enhance team autonomy by creating an API",
            "sessionKeyTakeAway4": "Viewing the company as a solar system not a heirarchy and how to use OKRs to supercharge prioritisation and replace the backlog with a story generator",
            "sessionLevel": "20",
            "sessionSpeakerName": "Allan Kelly",
            "sessionSpeakersOther": [],
            "sessionTagMain": "People & Teams",
            "sessionTags": [],
            "sessionTitle": "Reawakening Agile with OKRs",
            "sessionURL": "reawakening-agile-with-okrs",
            "sessionType": "40",
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§SMpH8XCoBZXKY5f9n§2",
            "sessionScheduleRoom": "Wonderland",
            "sessionScheduleSlot": "2",
            "sessionSpeakerImagePuId": "2022_speakers/allan-allankelly-net",
            "sessionSpeakerURL": "allan-kelly",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "10:30:00"
        },
        {
            "_id": "v5Edbq4QBbHMy2jMD",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Are your automation practices accounting for the database? How do you verify database software quality? Most importantly, how do you care for customer data as the schema evolves? Let's dig into building a CI/CD pipeline for databases. We'll leverage Red Gate tools and containers for automation, testing, and push-button deployment. You can bring DevOps to the database.",
            "sessionKeyTakeAway1": "What options do I have for storing database schema?  (state-based and migrations-based)  What are the pros & cons?",
            "sessionKeyTakeAway2": "How do I build a state-based DevOps pipeline for databases?  How is it different in a cloud build?",
            "sessionKeyTakeAway3": "How do I build a migrations-based DevOps pipeline for databases?  How is it different in a cloud build?",
            "sessionKeyTakeAway4": "How can I take this further?  (Here's a GitHub repo for you to clone.)",
            "sessionLevel": "20",
            "sessionSpeakerName": "Rob Richardson",
            "sessionTagMain": "DevOps",
            "sessionTags": [
                "Architecture"
            ],
            "sessionTitle": "A Database DevOps Pipeline",
            "sessionTitleShort": "A Database DevOps Pipeline",
            "sessionType": "40",
            "sessionURL": "a-database-devops-pipeline",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§LYCz3myi2sMKuztYB§2",
            "sessionScheduleRoom": "Wrong way",
            "sessionScheduleSlot": "2",
            "sessionSpeakerImagePuId": "2022_speakers/robrich-robrich-org",
            "sessionSpeakerURL": "rob-richardson",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "10:30:00"
        },
        {
            "_id": "r54RjNcjDiHjbWmYW",
            "conferencename": "Øredev 2022",
            "sessionDescription": "It’s easy to talk about shifting left, but this brings testing into the world of the programmer, and programmers generally won’t stop coding to spend days developing and performing deep testing. What they mean by “testing” is relatively simple output checking. That’s important work, but it’s not the same as a deep investigation of the product for problems that thwart the needs and desires of the people using it.\nDeep testing may never happen in a shift-left regime, which then forces testing work to the right— into the world of production and users. We call that “squish left and right,\" which means that there is pressure not to allow testers to perform a competent test process. How do we resist this pressure? How do we advocate for the kind of testing that reveals problems that matter?  What might get lost in transformation?\nIn this presentation, Michael Bolton will share the Rapid Software Testing perspective on testing in a devops context. He’ll show how to see the value of devops practices from a new perspective that honours both checking the build and testing the product.",
            "sessionKeyTakeAway1": "The word \"testing\" is heavily overloaded, which leads to confusion about its goals and roles.",
            "sessionKeyTakeAway2": "Software development happens in (at least) four frames. Each emphasizes different activities and risks, addressed by different approaches to testing.",
            "sessionKeyTakeAway3": "Deep testing maximizes the chance of finding every elusive bug that matters, but deep testing can disrupt the developer's work flow.",
            "sessionKeyTakeAway4": "Checking the units, the components, and the build helps developers to maintain awareness and discipline, but that's not the same thing as testing the product.",
            "sessionLevel": "20",
            "sessionSpeakerName": "Michael Bolton",
            "sessionSpeakersOther": [],
            "sessionTagMain": "DevOps",
            "sessionTags": [
                "People & Teams"
            ],
            "sessionTitle": "Shift Left or Squish Right — Testing in a Shifting World",
            "sessionType": "40",
            "sessionURL": "shift-left-or-squish-right-testing-in-a-shifting-world",
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§mLsppTucSgZEvLukS§3",
            "sessionScheduleRoom": "Downstairs",
            "sessionScheduleSlot": "3",
            "sessionSpeakerImagePuId": "2022_speakers/michael-developsense-com",
            "sessionSpeakerURL": "michael-bolton",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "11:30:00"
        },
        {
            "_id": "8Rki7SGbZiFqhpvbp",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Maintaining a good temperature is important in really good BBQ.\nIn this session we will take a look how to create an IoT enabled BBQ smoker using RasperryPi and AWS Greengrass.\nWe will also dive deep among AWS services to create a serverless system, using services like AWS IoT Core, AWS Lambda, Amazon EventBridge, that can be used to notify you when temperature fall outside of a specified range.\nLastly we will briefly touch on how to create an API to power an web based dashboard.",
            "sessionKeyTakeAway1": "You will learn how to create an serverless IoT system in AWS",
            "sessionKeyTakeAway2": "You will also learn a thing or two about event driven systems",
            "sessionKeyTakeAway3": "Lastly you might pick up a trick or two when it come to BBQ",
            "sessionLevel": "30",
            "sessionSpeakerName": "Jimmy Dahlqvist",
            "sessionTagMain": "Cloud",
            "sessionTags": [
                "Web",
                "Architecture"
            ],
            "sessionTitle": "IoT enabled smoker for great BBQ",
            "sessionType": "40",
            "sessionURL": "iot-enabled-smoker-for-great-bbq",
            "sessionTitleShort": "IoT enabled BBQ smoker",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§Z569Ch8xnaEsMZjir§3",
            "sessionScheduleRoom": "Nowhere",
            "sessionScheduleSlot": "3",
            "sessionSpeakerImagePuId": "2022_speakers/jimmy-dqvist-se",
            "sessionSpeakerURL": "jimmy-dahlqvist",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "11:30:00"
        },
        {
            "_id": "vMYjW2svLzSL9ZNh3",
            "conferencename": "Øredev 2022",
            "sessionDescription": "You've been climbing the tower of software development for a while - maybe a few years, perhaps a decade - maybe even more. Your peers admire you, your managers praise you, and you have become one with your work. Yet, something is missing.\n\nThere is a feeling in you that the work you do could matter more - that you could benefit your peers and your product more, but that might require a leap. A leap that, for many software professionals, is hard to do, a leap towards leadership.\n\nIn this session, we explore what happens when you leap towards technical leadership - what happens with you, your peers, your career. What skills do you need to develop, and what can you bring with you. What hurdles will you encounter, and how do you conquer them.\n\nMartin draws on his personal experience as developer turned leader, manager and cofounder and distils the ideas he wishes someone told him when he leapt.\n\nThis session is for people becoming, or interested in becoming, technical leaders.",
            "sessionKeyTakeAway1": "How you go from tech to leadership",
            "sessionKeyTakeAway2": "How to lead yourself",
            "sessionKeyTakeAway3": "What to watch out for when doing the transition",
            "sessionKeyTakeAway4": "A concrete example of how one person did it",
            "sessionLevel": "20",
            "sessionSpeakerName": "Martin Mazur",
            "sessionTagMain": "People & Teams",
            "sessionTags": [],
            "sessionTitle": "The Leaders Leap - When your work becomes about people",
            "sessionTitleShort": "The Leaders Leap",
            "sessionType": "40",
            "sessionURL": "the-leaders-leap-when-your-work-becomes-about-people",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§eWnqdASsnFYcsWrZC§3",
            "sessionScheduleRoom": "Somewhere",
            "sessionScheduleSlot": "3",
            "sessionSpeakerImagePuId": "2022_speakers/martin-1337-tech",
            "sessionSpeakerURL": "martin-mazur",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "11:30:00"
        },
        {
            "_id": "2CfxYS8sxtmviozZk",
            "conferencename": "Øredev 2022",
            "sessionDescription": "The White Queen shared with us some insights on the future of GraphQL, a story about great developer experience, running GraphQL APIs everywhere, streaming results, and GraphQL for microservices.\nJoin us in the adventure of the future of GraphQL to see how most of it can already be put into practice with GraphQL Yoga and Envelop.",
            "sessionKeyTakeAway1": "We will see what is the future of GraphQL and how to use it now",
            "sessionKeyTakeAway2": "You will learn how to build a powerful and modern GraphQL API under a few minutes",
            "sessionKeyTakeAway3": "You will learn how to build a GraphQL API that runs everywhere",
            "sessionLevel": "20",
            "sessionSpeakerName": "Charly Poly",
            "sessionTagMain": "Web",
            "sessionTags": [],
            "sessionTitle": "GraphQL APIs – Through the Looking Glass",
            "sessionTitleShort": "The future of GraphQL APIs",
            "sessionType": "40",
            "sessionURL": "graphql-apis-through-the-looking-glass",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§AgyfqDGL2sPCs4Ycj§3",
            "sessionScheduleRoom": "This way",
            "sessionScheduleSlot": "3",
            "sessionSpeakerImagePuId": "2022_speakers/charly-the-guild-dev",
            "sessionSpeakerURL": "charly-poly",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "11:30:00"
        },
        {
            "_id": "zhtbYq7ws49Pznv5t",
            "conferencename": "Øredev 2022",
            "sessionDescription": "With an increasing need for scalability and performance dictated by the modern web, it becomes harder and harder to choose an API paradigm that is suitable for service to service communication.\n\nWhile the classical models still work and have their own merits, some of them rely heavily on documentation, extensive coordination between teams or code-sharing.  We use shared libraries, and over time our projects become intertwined with dependencies. In these cases, we need something to untangle those and reduce coupling. Welcome gRPC.\n\ngRPC has been around for a while and .NET Core 3.0 welcomes it as a first-class citizen. It is contract-based, performant - with smaller response/request bodies, perfect for polyglot environments and supports different models – from client-server, to bi-directional streaming out of the box.\nIn this session, we will look at how to use gRPC and its 4 models and what are the benefits and or downsides of using gRPC compared to the traditional models.",
            "sessionKeyTakeAway1": "You will learn how to use gRPC in .NET in a microservice architecure",
            "sessionKeyTakeAway2": "Client-side load balancing without external tools",
            "sessionKeyTakeAway3": "Retry policies out of the box",
            "sessionLevel": "20",
            "sessionSpeakerName": "Irina Scurtu",
            "sessionTagMain": ".NET",
            "sessionTags": [
                "Web",
                "Polyglot & Fringe"
            ],
            "sessionTitle": "Embracing gRPC in .NET",
            "sessionType": "40",
            "sessionURL": "embracing-grpc-in-net",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§fcC2ASEZqJbm2mzhT§3",
            "sessionScheduleRoom": "Upstairs",
            "sessionScheduleSlot": "3",
            "sessionSpeakerImagePuId": "2022_speakers/scurtuirina-gmail-com",
            "sessionSpeakerURL": "irina-scurtu",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "11:30:00"
        },
        {
            "_id": "rfQAGnbsmXmxusLkk",
            "conferencename": "Øredev 2022",
            "sessionDescription": "MongoDB is easy, it lets you create and store objects of any shape in the database. What I didn't realize when I started designing the Nets next generation payment system was that Moving from RDBMS data design to Document Design is a learned skill where you need to apply patterns and take into account not just the data but the way the data will be accessed. Working with experts made a huge difference - like an air traffic controller on the team talking the amateur pilot down when they take over a Boeing 747.",
            "sessionKeyTakeAway1": "Why schema design matters for scaling NoSQL",
            "sessionKeyTakeAway2": "When to embed and when not to",
            "sessionKeyTakeAway3": "How to deal with arrays and indexing efficiently",
            "sessionKeyTakeAway4": "Why we picked MongoDB Atlas",
            "sessionLevel": "30",
            "sessionSpeakerName": "Johannes Brännström",
            "sessionTagMain": "Cloud",
            "sessionTags": [
                "Web",
                "Architecture",
                "Security"
            ],
            "sessionTitle": "How we scaled a payments system to the whole of Europe using the next generation relational database, MongoDB!",
            "sessionTitleShort": "Scaling payments with the next generation relational database, MongoDB",
            "sessionType": "40",
            "sessionURL": "how-we-scaled-a-payments-system-to-the-whole-of-europe-using-the-next-generation-relational-database-mongodb-",
            "sessionSpeakersOther": [
                "EthinA828gP5YgZDL"
            ],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§SMpH8XCoBZXKY5f9n§3",
            "sessionScheduleRoom": "Wonderland",
            "sessionScheduleSlot": "3",
            "sessionSpeakerImagePuId": "2022_speakers/johannes-brannstrom-mongodb-com",
            "sessionSpeakerURL": "johannes-br-nnstr-m",
            "otherSpeakersShow": [
                {
                    "_id": "EthinA828gP5YgZDL",
                    "speakerFirstName": "Tahir",
                    "speakerLastName": "Jamal",
                    "speakerURL": "tahir-jamal",
                    "speakerImagePuId": "2022_speakers/tahir-jamal-nexigroup-com"
                }
            ],
            "sessionScheduleTime": "11:30:00"
        },
        {
            "_id": "zatWs9uLMWbAYidXx",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Every change of state in an enterprise is qualified as an ‘event’. Like synchronous REST APIs, it is possible to elevate asynchronous, event-centric interactions as event APIs to streamline business processes and create positive customer experiences. Enabling and exposing events in an enterprise as event API products can benefit internal and external stakeholders. To accomplish that, an enterprise needs the ability to: * Harness and expose digital value as events \n* Bundle and document events for sharing and automation using specifications such as AsyncAPI * Release the event API product to the world * Manage event API products using an event management platform that simplifies the entire event lifecycle\n\nAdoption of event API products will benefit from the experience of working with synchronous APIs, existing standards, and API management systems – eventually making it an integral part of complex problem-solving.\n\nThis talk includes a demonstration of building and consuming an event API product using Solace PubSub+ and AsyncAPI.",
            "sessionKeyTakeAway1": "How & Why organizations are using Event-Driven Architecture (EDA)",
            "sessionKeyTakeAway2": "What are Event API Products?",
            "sessionKeyTakeAway3": "How Event API Products enable your organization to get the move value out of it's EDA",
            "sessionLevel": "20",
            "sessionSpeakerName": "Hari Rangarajan",
            "sessionSpeakersOther": [],
            "sessionTagMain": "Architecture",
            "sessionTags": [],
            "sessionTitle": "Event API Products: Maximizing the Value of Your Event-Driven Architecture",
            "sessionType": "40",
            "sessionURL": "event-api-products-maximizing-the-value-of-your-event-driven-architecture",
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§LYCz3myi2sMKuztYB§3",
            "sessionScheduleRoom": "Wrong way",
            "sessionScheduleSlot": "3",
            "sessionSpeakerImagePuId": "2022_speakers/hari-rangarajan-solace-com",
            "sessionSpeakerURL": "hari-rangarajan",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "11:30:00"
        },
        {
            "_id": "2NAhGqzgYnFdS92f2",
            "conferencename": "Øredev 2022",
            "sessionDescription": "There are tons of resources available for someone who wants to become better at writing secure code, and lots of them are free. OWASP naturally comes to mind, and there are several active projects which should be recognized as bag of tricks in the discipline of secure development. And there are others as well! In this session we will give you some of our personal recommendations that will help both individuals, teams and organizations.",
            "sessionKeyTakeAway1": "How do you pick the best of OWASPs projects?",
            "sessionKeyTakeAway2": "Which resources goes where and when in the project timeline and processes?",
            "sessionLevel": "20",
            "sessionSpeakerName": "Johan Lindfors",
            "sessionTagMain": "Security",
            "sessionTags": [
                "DevOps"
            ],
            "sessionTitle": "Free security resources that your competitors use!",
            "sessionTitleShort": "Free security resources",
            "sessionType": "40",
            "sessionURL": "free-security-resources-that-your-competitors-use-",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§mLsppTucSgZEvLukS§4",
            "sessionScheduleRoom": "Downstairs",
            "sessionScheduleSlot": "4",
            "sessionSpeakerImagePuId": "2022_speakers/johan-lindfors-truesec-se",
            "sessionSpeakerURL": "johan-lindfors",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "13:00:00"
        },
        {
            "_id": "8PEPP8NsnQZuBJzsc",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Without data observability, you loose trust in the production data and all the shiny data magic technologies become useless.  It's a matter of hygiene similar to having an automated test suite and devops in software engineering.  We'll show you how data observability can be easily embedded in the engineers data pipelines.  And how the whole data team has to collaborate to ensure that alerts can be analyzed and resolved and that trust in data can be built up.  There are quite a few open source data tools available so we'll provide an overview to get you on your way.",
            "sessionKeyTakeAway1": "Data observability & data testing is easy because open source data tools fit within your pipelines",
            "sessionKeyTakeAway2": "If you're a software engineer, most of data observability principles you already know in a different flavour as TDD",
            "sessionKeyTakeAway3": "As an engineer, you have to ensure you don't become the bottleneck by enabling self-service check authoring",
            "sessionKeyTakeAway4": "Non actionable data alerts are useless so each check should have a workflow",
            "sessionLevel": "20",
            "sessionSpeakerName": "Tom Baeyens",
            "sessionTagMain": "Data Science",
            "sessionTags": [],
            "sessionTitle": "Five Sins of Data Observability",
            "sessionType": "40",
            "sessionURL": "five-sins-of-data-observability",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§Z569Ch8xnaEsMZjir§4",
            "sessionScheduleRoom": "Nowhere",
            "sessionScheduleSlot": "4",
            "sessionSpeakerImagePuId": "2022_speakers/tom-soda-io",
            "sessionSpeakerURL": "tom-baeyens",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "13:00:00"
        },
        {
            "_id": "tSDPru8gaa6rN72BW",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Do we really need mighty JavaScript frameworks to build modern UI? What about single page applications? Is it always the right choice? In this session we will discuss modern frontend development practices, how did we got here, and how we can adopt proven principles to simplify the complexity of modern frontend development.",
            "sessionKeyTakeAway1": "How KISS principles can simplify your frontend development",
            "sessionKeyTakeAway2": "What are the pros and cons of mighty single page applications",
            "sessionKeyTakeAway3": "Why BDD (Buzz driven development) is bad, and how to avoid it",
            "sessionKeyTakeAway4": "Which tools should we choose for the task?",
            "sessionLevel": "20",
            "sessionSpeakerName": "Nir Kaufman",
            "sessionTagMain": "Web",
            "sessionTags": [
                "Architecture"
            ],
            "sessionTitle": "Keep it simple! How to apply KISS principle in modern frontend",
            "sessionTitleShort": "Keep it simple!",
            "sessionType": "40",
            "sessionURL": "keep-it-simple-how-to-apply-kiss-principle-in-modern-frontend",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§eWnqdASsnFYcsWrZC§4",
            "sessionScheduleRoom": "Somewhere",
            "sessionScheduleSlot": "4",
            "sessionSpeakerImagePuId": "2022_speakers/nirkaufman-gmail-com",
            "sessionSpeakerURL": "nir-kaufman",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "13:00:00"
        },
        {
            "_id": "oaecfGbbTMCH6mDsR",
            "conferencename": "Øredev 2022",
            "sessionDescription": "In this talk we will go back a bit and discuss secure code. We will look at the constructs we are using (and not using) and why changing some of the ways we typically write our code, can have security benefits. We will grab some elements from (modern) Domain Driven Design and see how we can use this to avoid or limit vulnerabilities.",
            "sessionKeyTakeAway1": "A structured approach to handling input",
            "sessionKeyTakeAway2": "Ways to structure code to reduce bugs",
            "sessionLevel": "20",
            "sessionSpeakerName": "Erlend Oftedal",
            "sessionTagMain": "Security",
            "sessionTags": [
                "Architecture"
            ],
            "sessionTitle": "Secure Coding - Back to basics",
            "sessionTitleShort": "Secure Coding Basics",
            "sessionType": "40",
            "sessionURL": "secure-coding-back-to-basics",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§AgyfqDGL2sPCs4Ycj§4",
            "sessionScheduleRoom": "This way",
            "sessionScheduleSlot": "4",
            "sessionSpeakerImagePuId": "2022_speakers/erlend-oftedal-no",
            "sessionSpeakerURL": "erlend-oftedal",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "13:00:00"
        },
        {
            "_id": "ipcfwRJkEwX5sjKGT",
            "sessionTitle": "Building Android apps in 2022",
            "sessionTitleShort": "Building Android apps in 2022",
            "sessionLevel": "20",
            "sessionType": "40",
            "sessionTagMain": "Mobile",
            "sessionTags": [
                "Architecture"
            ],
            "sessionKeyTakeAway1": "Learn how to successfully build Android applications in 2022!",
            "sessionKeyTakeAway2": "Find out what are the best practices, libraries and tools for Android development",
            "sessionKeyTakeAway3": "You will learn the dos and don'ts for modern Android development",
            "sessionKeyTakeAway4": "How to build Android applications of high quality",
            "sessionDescription": "Android is the most used operating system in the world, spanning from TVs, smartphones, and tablets, to wearables, in-car infotainment and much more. The challenges that we face as app developers for Android is a huge set of tools, libraries, and frameworks, as well as practical challenges for testing and deploying applications at scale. \n\nIn this session Erik will cover that state of Android development in 2022 and how to be a successful app developer today. You'll learn of the technologies you need to master, best practices for you software architecture, and how to deal with common yet complex scenarios like offline support, UI testing, and CI/CD solutions that doesn't impede your team. \n\nWe will cover hot new topics like the latest AndroidX libraries and Jetpack Compose, as well as best practices for Dependency Injection, Gradle build scripts, and Kotlin tips'n'tricks. This session should prepare you and your team, regardless if you have a legacy app you're maintaining or if you are about to build a brand new app.",
            "conferencename": "Øredev 2022",
            "sessionURL": "building-android-apps-in-2022",
            "sessionSpeakerName": "Erik Hellman",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§fcC2ASEZqJbm2mzhT§4",
            "sessionScheduleRoom": "Upstairs",
            "sessionScheduleSlot": "4",
            "sessionSpeakerImagePuId": "2022_speakers/erik-hellman-iteam-se",
            "sessionSpeakerURL": "erik-hellman",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "13:00:00"
        },
        {
            "_id": "oSLthsWAEf8KdY7h4",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Are you tired of spending more time estimating and forecasting when work will be done than you spend actually doing the work? Exaggeration or not, if you calculate the value of the time used by your experts to go deep into requirements to break down tasks and estimate time, how much does it cost? How often do those expensive estimates turn out to be wrong despite your investment? The exciting news is that there's a way that you can save money and stress to quickly generate forecasts that are as reliable, or better, than the ones you're slaving over today. \n\nIn this session you'll learn about the components of a probabilistic forecast and how to use two simple metrics, cycle time and throughput, to create and continuously update your forecasts. You'll learn that if you track the start and finish time of your work, then you can use your historical data to learn the possible outcomes and the odds of each, allowing you to choose the appropriate forecast for the level of risk you're willing to accept. When you leave this session you'll have solid tactics to answer the questions \"How much can we complete by X date?\" and \"How long will this take?\" for both individual and multiple work items.",
            "sessionKeyTakeAway1": "You'll learn what a probabilistic forecasts are and why you want to use them",
            "sessionKeyTakeAway2": "You'll learn the basic data you need to capture to create them",
            "sessionKeyTakeAway3": "You'll understand the basic assumption behind using historical data for forecasting",
            "sessionKeyTakeAway4": "You'll leave with tactics for answering the question \"When will it be done?\"",
            "sessionLevel": "10",
            "sessionSpeakerName": "Julia Wester",
            "sessionTagMain": "People & Teams",
            "sessionTags": [
                "Data Science"
            ],
            "sessionTitle": "What are the odds? Transforming forecasts through probabilities",
            "sessionTitleShort": "Transforming forecasts through probabilities",
            "sessionType": "40",
            "sessionURL": "what-are-the-odds-transforming-forecasts-through-probabilities",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§SMpH8XCoBZXKY5f9n§4",
            "sessionScheduleRoom": "Wonderland",
            "sessionScheduleSlot": "4",
            "sessionSpeakerImagePuId": "2022_speakers/julia-55degrees-se",
            "sessionSpeakerURL": "julia-wester",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "13:00:00"
        },
        {
            "_id": "TZWa2kznm9yvA8Tve",
            "conferencename": "Øredev 2022",
            "sessionDescription": "In this session, you’ll see how the new Generic Math features in .NET will change how you implement calculations in your applications and libraries. We will explore the dozens of new interfaces applied to .NET’s primitive types, see examples of how they can simplify your code, and look at best practices for implementing algorithms using these new capabilities.",
            "sessionKeyTakeAway1": "What is Generic Math and what APIs were introduced?",
            "sessionKeyTakeAway2": "What does Generic Math enable in application and library code?",
            "sessionKeyTakeAway3": "How are other APIs within .NET using Generic Math?",
            "sessionLevel": "20",
            "sessionSpeakerName": "Jeff Handley",
            "sessionTagMain": ".NET",
            "sessionTags": [],
            "sessionTitle": "Generic Math in .NET 7",
            "sessionURL": "generic-math-in-net-7",
            "sessionSpeakersOther": [],
            "sessionType": "40",
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§LYCz3myi2sMKuztYB§4",
            "sessionScheduleRoom": "Wrong way",
            "sessionScheduleSlot": "4",
            "sessionSpeakerImagePuId": "2022_speakers/jeff-jeffhandley-com",
            "sessionSpeakerURL": "jeff-handley",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "13:00:00"
        },
        {
            "_id": "x9qimsWasWeZoiwFM",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Software systems are socio-technical systems: software products are intertwined with the organizations that build them. Organizational forces shape the software, which in turn shapes the organization, locking both into structures and patterns that can be difficult to change. This reality is what we need to engage with if we want to have impact as software developers, if we want our ideas to count, if we want to influence the culture we work in and shape the software being built. It's not enough to be tech-proficient. We must be able to communicate clearly and honestly, build trust and collaborate effectively, gain support for our ideas, understand and empathize with the concerns and priorities of others, negotiate fairly, give and take, choose which battles to fight and which to leave alone. But that's easy to say - how do we do it in practice?",
            "sessionKeyTakeAway1": "You will learn how important the socio-technical environment is for our work as software developers",
            "sessionKeyTakeAway2": "You will learn how trust and self-defense mechanisms affect how we collaborate.",
            "sessionLevel": "20",
            "sessionSpeakerName": "Einar Høst",
            "sessionTagMain": "People & Teams",
            "sessionTags": [
                ".NET",
                "Architecture"
            ],
            "sessionTitle": "The socio-technical developer",
            "sessionType": "40",
            "sessionURL": "the-socio-technical-developer",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§mLsppTucSgZEvLukS§5",
            "sessionScheduleRoom": "Downstairs",
            "sessionScheduleSlot": "5",
            "sessionSpeakerImagePuId": "2022_speakers/einarwh-gmail-com",
            "sessionSpeakerURL": "einar-h-st",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "14:00:00"
        },
        {
            "_id": "Z647g27Q5cxKrQWEN",
            "conferencename": "Øredev 2022",
            "sessionDescription": "In a world of rapid changes and increasing uncertainties, organisations have to continuously adapt and evolve to remain competitive and excel in the market. In such a dynamic business landscape organisations need to design for adaptability.\n\nCombining different perspectives and techniques from business strategy (Wardley Mapping), software architecture and design (Domain-Driven Design), and team organisation (Team Topologies) provides a powerful toolset to design, build and evolve adaptive systems and team structures for a fast flow of change.\n\nThis talk illustrates the concepts, connects the dots between these three perspectives, and demonstrates how these techniques help to evolve a fictitious legacy system for a fast flow of change.\n\nThe journey describes the approach to evolve:\n\n    From functional silo teams to cross-functional autonomous stream-aligned teams and platform teams\n    From a monolithic big ball of mud to a modular, loosely coupled system\n    From running on-premises infrastructure to cloud-hosted services",
            "sessionKeyTakeAway1": "You will learn how to combine the three perspectives from Wardley Mapping, Domain-Driven Design and Team Topologies to evolve a system for fast flow",
            "sessionKeyTakeAway2": "You will get to know how to eliminate potential efficiency gaps and delivery bottlenecks",
            "sessionKeyTakeAway3": "You will have a better understanding of aligning teams and evolving their interactions to achieve fast flow",
            "sessionKeyTakeAway4": "You will learn techniques to identify in what parts of your domain to strategically invest most development effort and innovate on",
            "sessionLevel": "20",
            "sessionSpeakerName": "Susanne Kaiser",
            "sessionTagMain": "Architecture",
            "sessionTags": [
                "Cloud",
                "People & Teams"
            ],
            "sessionTitle": "Architecture for Flow with Wardley Mapping, DDD, and Team Topologies",
            "sessionType": "40",
            "sessionURL": "architecture-for-flow-with-wardley-mapping-ddd-and-team-topologies",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§Z569Ch8xnaEsMZjir§5",
            "sessionScheduleRoom": "Nowhere",
            "sessionScheduleSlot": "5",
            "sessionSpeakerImagePuId": "2022_speakers/susanne-susannekaiser-net",
            "sessionSpeakerURL": "susanne-kaiser",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "14:00:00"
        },
        {
            "_id": "f67CR7hmwzExRmihv",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Would you like to have constructive retrospectives that does not make people cry? Based on her experience with facilitating retrospectives, join Aino for an entertaining and informative presentation on the antipatterns she has seen and how to overcome the problems. Antipatterns are like patterns, only more informative. With antipatterns you will first see what patterns reoccur in \"bad\" retrospectives and then you will see how to avoid, or remedy, the situation. This talk is focused on retrospectives, but will be interesting for everyone facilitating any kind of meeting.",
            "sessionKeyTakeAway1": "How to plan, and facilitate a retrospective",
            "sessionKeyTakeAway2": "How to avoid the most common antipatterns in retrospectives",
            "sessionLevel": "10",
            "sessionSpeakerName": "Aino Vonge Corry",
            "sessionSpeakersOther": [],
            "sessionTagMain": "People & Teams",
            "sessionTags": [],
            "sessionTitle": "Retrospectives Antipatterns - Avoid my Mistakes",
            "sessionURL": "retrospectives-antipatterns-avoid-my-mistakes",
            "sessionType": "40",
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§eWnqdASsnFYcsWrZC§5",
            "sessionScheduleRoom": "Somewhere",
            "sessionScheduleSlot": "5",
            "sessionSpeakerImagePuId": "2022_speakers/aino-metadeveloper-com",
            "sessionSpeakerURL": "aino-vonge-corry",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "14:00:00"
        },
        {
            "_id": "j9eo5aLEhFMZErrHi",
            "sessionTitle": "Localization: Implementation and Testing... Locally",
            "sessionLevel": "20",
            "sessionType": "40",
            "sessionTagMain": "Web",
            "sessionTags": [
                "Quality & Test"
            ],
            "sessionKeyTakeAway1": "You'll learn about tools and resources available for adding localization to your React app",
            "sessionKeyTakeAway2": "You'll see how to implement localization and handle manual and automated testing in a local environment",
            "sessionDescription": "So you have a product and are planning to ship to a global audience. But you’re still using dun dun dun hard coded English strings! In this talk, you’ll learn how to set up the infrastructure for localization in your React app and how to test your implementations locally, without needing to speak another language!",
            "conferencename": "Øredev 2022",
            "sessionURL": "localization-implementation-and-testing-locally",
            "sessionSpeakerName": "Isabela Moreira",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§AgyfqDGL2sPCs4Ycj§5",
            "sessionScheduleRoom": "This way",
            "sessionScheduleSlot": "5",
            "sessionSpeakerImagePuId": "2022_speakers/isabela-cmor-gmail-com",
            "sessionSpeakerURL": "isabela-moreira",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "14:00:00"
        },
        {
            "_id": "82TwskWRc2pDc9j2C",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Automation is important, after all, we didn’t choose this line of work because we like manual labour. Most of us are now used to IaC but quite often that isn’t really code but rather in the form of yaml templates or another templating language such as Terraform. With CDK (Cloud Development Kit) you can now instead use Typescript to not only define your resources and applications but also the deployment infrastructure that surrounds it.\n\nIn this session we will go through how to setup your applications and pipelines with CDK. You will see how CDK can help you with not only defining your infrastructure but also to package your applications. You will also see how you can set up your pipelines and automation with CDK as well. As a developer you will appreciate being able to use code to set up everything. As a DevOps you will enjoy having your automation automated and testable.",
            "sessionKeyTakeAway1": "Use CDK to package and deploy your applications and infrastructure",
            "sessionKeyTakeAway2": "Manage pipelines & deployments through CDK",
            "sessionKeyTakeAway3": "Best practices for integration with Github Actions and other CI/CD tools",
            "sessionLevel": "30",
            "sessionSpeakerName": "Johannes Pelto-Piri",
            "sessionTagMain": "Cloud",
            "sessionTags": [
                "Architecture",
                "DevOps"
            ],
            "sessionTitle": "Automate everything with CDK in AWS",
            "sessionTitleShort": "Automate everything with CDK in AWS",
            "sessionType": "40",
            "sessionURL": "automate-everything-with-cdk-in-aws",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§fcC2ASEZqJbm2mzhT§5",
            "sessionScheduleRoom": "Upstairs",
            "sessionScheduleSlot": "5",
            "sessionSpeakerImagePuId": "2022_speakers/johannes-peltopiri-gmail-com",
            "sessionSpeakerURL": "johannes-pelto-piri",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "14:00:00"
        },
        {
            "_id": "hukW2X7hu8bkdbt57",
            "conferencename": "Øredev 2022",
            "sessionDescription": "In this hands-on tips-and-tricks session, you’ll learn how to increase your productivity and discover a few new things about your favorite package manager directly from the NuGet team.",
            "sessionKeyTakeAway1": "You will learn best practices when authoring packages",
            "sessionKeyTakeAway2": "You'll learn about the latest features in NuGet",
            "sessionKeyTakeAway3": "You will understand how to improve supply chain security",
            "sessionKeyTakeAway4": "You'll get a look at our upcoming plans",
            "sessionLevel": "20",
            "sessionSpeakerName": "Claire Novotny",
            "sessionTagMain": ".NET",
            "sessionTags": [],
            "sessionTitle": "NuGet: things you didn't know",
            "sessionType": "40",
            "sessionURL": "nuget-things-you-didn-t-know",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§SMpH8XCoBZXKY5f9n§5",
            "sessionScheduleRoom": "Wonderland",
            "sessionScheduleSlot": "5",
            "sessionSpeakerImagePuId": "2022_speakers/claire-novotny-microsoft-com",
            "sessionSpeakerURL": "claire-novotny",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "14:00:00"
        },
        {
            "_id": "iRjZAnPo66AoiDsXb",
            "conferencename": "Øredev 2022",
            "sessionDescription": "In the last few years, many organizations have suffered from ransomware attacks. Recovering from a ransomware attack usually requires backups, but in some cases there are other ways. In this session, Alexander will showcase his team's latest research in ransomware decryption capabilities. The research breaks an entire family of ransomware variants and allows victims to restore encrypted data without obtaining the private keys.",
            "sessionKeyTakeAway1": "Get an insight from the frontlines and how ransomware are affecting organizations",
            "sessionKeyTakeAway2": "How ransomware implements encryption and how it some times can be subverted",
            "sessionKeyTakeAway3": "How to exploit crypto weaknesses and implement a practical cryptographic attack",
            "sessionLevel": "30",
            "sessionSpeakerName": "Alexander Andersson",
            "sessionTagMain": "Security",
            "sessionTags": [
                ".NET"
            ],
            "sessionTitle": "Cracking a ransomware family",
            "sessionType": "40",
            "sessionURL": "cracking-a-ransomware-family",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§LYCz3myi2sMKuztYB§5",
            "sessionScheduleRoom": "Wrong way",
            "sessionScheduleSlot": "5",
            "sessionSpeakerImagePuId": "2022_speakers/alexander-andersson-truesec-se",
            "sessionSpeakerURL": "alexander-andersson",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "14:00:00"
        },
        {
            "_id": "C4xLmDfF9qSBkubmw",
            "conferencename": "Øredev 2022",
            "sessionDescription": "In this session, you will learn about how to improve the detection of hostile web client behaviour. Learn how to recognise a victim of phishing and improve the log patterns to identify the most common HTTP attacks.",
            "sessionKeyTakeAway1": "You will learn where to put log entries to catch anomalies in web applications.",
            "sessionKeyTakeAway2": "You will also learn about the distinctions between different log types.",
            "sessionKeyTakeAway3": "You will be able to recognise deliberate attacks from mistakes.",
            "sessionLevel": "20",
            "sessionSpeakerName": "Christoffer Jerkeby",
            "sessionTagMain": "Web",
            "sessionTags": [
                "Security"
            ],
            "sessionTitle": "This is application purple teaming",
            "sessionTitleShort": "Application purple teaming explained",
            "sessionType": "40",
            "sessionURL": "this-is-application-purple-teaming",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§mLsppTucSgZEvLukS§6",
            "sessionScheduleRoom": "Downstairs",
            "sessionScheduleSlot": "6",
            "sessionSpeakerImagePuId": "2022_speakers/christoffer-jerkeby-se",
            "sessionSpeakerURL": "christoffer-jerkeby",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "15:20:00"
        },
        {
            "_id": "8vpmwKR7hnH5EmvY6",
            "sessionTitle": "Data Mesh: Data Analytics for Engineers",
            "sessionTitleShort": "Data Mesh",
            "sessionLevel": "10",
            "sessionType": "40",
            "sessionTagMain": "Data Science",
            "sessionTags": [
                "Architecture",
                "People & Teams"
            ],
            "sessionKeyTakeAway1": "Why product teams need to own analytical data.",
            "sessionKeyTakeAway2": "Why user stories should be evaluated with data.",
            "sessionKeyTakeAway3": "How to build data products?",
            "sessionDescription": "Data Mesh enables software engineering teams to perform cross-domain data analysis on their own and provide managed analytical data for other teams using data interface specifications, similar to microservice APIs.\n\nData Mesh is the logical consequence of Strategic Domain-driven Design and autonomous product teams building self-contained systems.\n\nIn this session, Jochen, author of datamesh-architecture.com, will introduce Data Mesh from an engineering perspective and shows a number of examples and technologies that can help to build a Data Mesh.",
            "conferencename": "Øredev 2022",
            "sessionURL": "data-mesh-data-analytics-for-engineers",
            "sessionSpeakerName": "Jochen Christ",
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§Z569Ch8xnaEsMZjir§6",
            "sessionScheduleRoom": "Nowhere",
            "sessionScheduleSlot": "6",
            "sessionSpeakerImagePuId": "2022_speakers/jochen-christ-innoq-com",
            "sessionSpeakerURL": "jochen-christ",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "15:20:00"
        },
        {
            "_id": "jnYz8NWk84FEtenrZ",
            "sessionTitle": "Micro-frontends anti-patterns",
            "sessionLevel": "20",
            "sessionType": "40",
            "sessionTagMain": "Web",
            "sessionTags": [
                "Architecture"
            ],
            "sessionKeyTakeAway1": "how to avoid common mistakes when we implement micro-frontends",
            "sessionKeyTakeAway2": "the key benefits of micro-frontends",
            "sessionDescription": "Micro-Frontends are the distributed architecture for the user interfaces that are solving not only technical but also organizational challenges.\n\nIn this session, you will learn the most common anti-patterns I've seen in the past 7 years of implementing and consulting multiple companies in their journey into the micro-frontends architecture. Whether you are an expert or a newbie, in this talk, you will learn how to structure properly your micro-frontends architecture and how to avoid common mistakes meanwhile building micro-frontends.",
            "conferencename": "Øredev 2022",
            "sessionURL": "micro-frontends-anti-patterns",
            "sessionSpeakerName": "Luca Mezzalira",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§eWnqdASsnFYcsWrZC§6",
            "sessionScheduleRoom": "Somewhere",
            "sessionScheduleSlot": "6",
            "sessionSpeakerImagePuId": "2022_speakers/mezzalab-gmail-com",
            "sessionSpeakerURL": "luca-mezzalira",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "15:20:00"
        },
        {
            "_id": "8AxzqXrtDFeT94Cam",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Providing reliability at a massive scale, while maintaining performance, has always been a challenge for companies. With a number of server failures at any given time in a huge infrastructure, using scalable failure detection algorithms becomes necessary.",
            "sessionKeyTakeAway1": "You will learn concepts of building highly available and scalable systems that are susceptible to failure, for business critical applications.",
            "sessionKeyTakeAway2": "This talk will assume some basic knowledge of distributed systems. It will tie implementation to theory and attempt to bridge the gap between the two.",
            "sessionLevel": "20",
            "sessionSpeakerName": "Jinal Parikh",
            "sessionSpeakersOther": [],
            "sessionTagMain": "Architecture",
            "sessionTags": [
                "DevOps"
            ],
            "sessionTitle": "Are you dead or alive?: Using Gossip for Failure Detection",
            "sessionTitleShort": "Using Gossip for Failure Detection",
            "sessionType": "40",
            "sessionURL": "are-you-dead-or-alive-using-gossip-for-failure-detection",
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§AgyfqDGL2sPCs4Ycj§6",
            "sessionScheduleRoom": "This way",
            "sessionScheduleSlot": "6",
            "sessionSpeakerImagePuId": "2022_speakers/jinalparikh410-gmail-com",
            "sessionSpeakerURL": "jinal-parikh",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "15:20:00"
        },
        {
            "_id": "mCwjzY9Tb2BLXXcPY",
            "sessionTitle": "Offline first Flutter applications",
            "sessionLevel": "20",
            "sessionType": "40",
            "sessionTagMain": "Mobile",
            "sessionTags": [],
            "sessionKeyTakeAway1": "You will learn the optimal architecture for your Flutter applications to support offline-first.",
            "sessionKeyTakeAway2": "You will learn about Flutter libraries that will support you on going offine-first.",
            "sessionKeyTakeAway3": "You will learn about the importance of offline first",
            "sessionKeyTakeAway4": "You will learn about how one solution can work on multiple platforms at once.",
            "sessionDescription": "Even though the world is becoming more \"online\" every day, there are still a lot of parts of the world that we all suffer connectivity problems. And, as we all know, as good developers, we should not let that affect the users' experiences in our applications.\n\nThinking \"offline\" first is a concept that we all suffer to achieve. With our Superlist application, we did a couple of experiments about being offline first, giving a seamless experience to the users on mobile and Desktop. \n\nWith this talk, I will share our experience with thinking \"offline\" first. You will learn about, what Flutter offers for being \"offline\" first, how you can achieve a great experience for your users by architecting your app the correct way, and most importantly, you will learn what NOT to do. :)",
            "conferencename": "Øredev 2022",
            "sessionURL": "offline-first-flutter-applications",
            "sessionSpeakerName": "Muhammed Salih Güler",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§fcC2ASEZqJbm2mzhT§6",
            "sessionScheduleRoom": "Upstairs",
            "sessionScheduleSlot": "6",
            "sessionSpeakerImagePuId": "2022_speakers/muhammedsalihguler-gmail-com",
            "sessionSpeakerURL": "muhammed-salih-g-ler",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "15:20:00"
        },
        {
            "_id": "TxoAZcGC8WdkkCpHv",
            "conferencename": "Øredev 2022",
            "sessionDescription": "In 2021, Swedish national television (SVT) aired a six-part TV series called “Hacked” where 4 professional hackers set out to hack into the private assets of normal people, celebrities, and companies. They had all agreed to participate in a cyber security experiment but were unaware of what exactly was going to happen. Linus was one of the 4 hackers in the TV series and in this talk, he is going to talk about some of the highlights that were seen on-screen as well as behind the scenes. This talk will hopefully be both entertaining and eye-opening.",
            "sessionKeyTakeAway1": "It will show how it is to hack people and organizations on TV",
            "sessionKeyTakeAway2": "It will hopefully raise awareness on the topic of cyber security",
            "sessionLevel": "10",
            "sessionSpeakerName": "Linus Kvarnhammar",
            "sessionTagMain": "Security",
            "sessionTags": [],
            "sessionTitle": "Hacked on national television",
            "sessionType": "40",
            "sessionURL": "hacked-on-national-television",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§SMpH8XCoBZXKY5f9n§6",
            "sessionScheduleRoom": "Wonderland",
            "sessionScheduleSlot": "6",
            "sessionSpeakerImagePuId": "2022_speakers/linus-kvarnhammar-com",
            "sessionSpeakerURL": "linus-kvarnhammar",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "15:20:00"
        },
        {
            "_id": "oZpwcYWiZc8sbakmR",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Platform and Enablement teams is a requirement for a healthy DevOps culture, but where do you start? Join this session to hear from Jessica how she built a Platform team from scratch at Kognic, a fast paced scale-up company.",
            "sessionKeyTakeAway1": "You will learn how to move from 0 to something",
            "sessionKeyTakeAway2": "You will learn methods on how to scale out Platform Engineering in a growing organisation",
            "sessionLevel": "20",
            "sessionSpeakerName": "Jessica Andersson",
            "sessionSpeakersOther": [],
            "sessionTagMain": "DevOps",
            "sessionTags": [
                "Cloud"
            ],
            "sessionTitle": "Building Platform Engineering from scratch at scale-up",
            "sessionType": "40",
            "sessionURL": "building-platform-engineering-from-scratch-at-scale-up",
            "sessionTitleShort": "Platform for Scale-ups",
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§LYCz3myi2sMKuztYB§6",
            "sessionScheduleRoom": "Wrong way",
            "sessionScheduleSlot": "6",
            "sessionSpeakerImagePuId": "2022_speakers/jesandeit-gmail-com",
            "sessionSpeakerURL": "jessica-andersson",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "15:20:00"
        },
        {
            "_id": "gExY9vF3zYGqSt2cM",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Once malicious access to a computer in a company network has been obtained the second stage is try to gain full access to the entire domain. Did you know that once work has begun on the second stage 58% of breaches will gain full domain control within 2 hours! High value targets for threat actors are administrator accounts with high access privileges and credentials to many systems so developer workstations are potential gold mines! This talk will go through some of the top listed things you as a developer should think about daily to keep your workstation safer in a corporate environment.",
            "sessionKeyTakeAway1": "Everyone can do some simple things to improve your local security",
            "sessionKeyTakeAway2": "But there are more advanced things you can do to be more secure",
            "sessionKeyTakeAway3": "What is it we are defending ourselfs against?",
            "sessionLevel": "20",
            "sessionSpeakerName": "Thomas Andolf",
            "sessionTagMain": "Security",
            "sessionTags": [],
            "sessionTitle": "The top list of securing your developer workstation",
            "sessionTitleShort": "The top list of securing your developer workstation",
            "sessionType": "40",
            "sessionURL": "the-top-list-of-securing-your-developer-workstation",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§mLsppTucSgZEvLukS§7",
            "sessionScheduleRoom": "Downstairs",
            "sessionScheduleSlot": "7",
            "sessionSpeakerImagePuId": "2022_speakers/thomas-andolf-truesec-se",
            "sessionSpeakerURL": "thomas-andolf",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "16:20:00"
        },
        {
            "_id": "9AvMFn6hsjvkdQLiE",
            "conferencename": "Øredev 2022",
            "sessionDescription": "In this talk we will talk about how to create event driven and serverless architectures that can easily scale to burst and virtually meet any demand with little to none operational overhead.\nWe will code and build an event driven serverless Slackbot on stage.",
            "sessionKeyTakeAway1": "You will learn how to build event driven systems in AWS using Amazon EventBridge",
            "sessionKeyTakeAway2": "You will learn how to use serverless services in an event driven system",
            "sessionLevel": "20",
            "sessionSpeakerName": "Jimmy Dahlqvist",
            "sessionTagMain": "Cloud",
            "sessionTags": [
                "Architecture"
            ],
            "sessionTitle": "Building a serverless event driven Slack Bot",
            "sessionTitleShort": "Event driven Slack bot",
            "sessionType": "40",
            "sessionURL": "building-a-serverless-event-driven-slack-bot",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§Z569Ch8xnaEsMZjir§7",
            "sessionScheduleRoom": "Nowhere",
            "sessionScheduleSlot": "7",
            "sessionSpeakerImagePuId": "2022_speakers/jimmy-dqvist-se",
            "sessionSpeakerURL": "jimmy-dahlqvist",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "16:20:00"
        },
        {
            "_id": "DLfTvbkEquH7XcdcX",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Developing data projects is fundamentally different from traditional software development. This talk will provide a better vocabulary to talk about these differences and the nuances of data projects. It will also provide concrete advice on how understanding and communicating these differences can improve your relationships with stakeholders, make your data product and project management more effective, and drive improved data science outcomes.",
            "sessionKeyTakeAway1": "You will learn how developing data products is dramatically different from traditional software development",
            "sessionKeyTakeAway2": "You will be able to set the right expectations with stakeholders up front to reduce churn",
            "sessionKeyTakeAway3": "You will discover how tweaks to agile processes can make your data product development more successful",
            "sessionKeyTakeAway4": "You will learn to build a culture that embraces failures as opportunities to learn",
            "sessionLevel": "20",
            "sessionSpeakerName": "Caitlin Moorman",
            "sessionTagMain": "Data Science",
            "sessionTags": [
                "People & Teams"
            ],
            "sessionTitle": "Don't Run Around in Circles: Managing Circularity in Data Product Development",
            "sessionTitleShort": "Circular v. Linear Development",
            "sessionType": "40",
            "sessionURL": "don-t-run-around-in-circles-managing-circularity-in-data-product-development",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§eWnqdASsnFYcsWrZC§7",
            "sessionScheduleRoom": "Somewhere",
            "sessionScheduleSlot": "7",
            "sessionSpeakerImagePuId": "2022_speakers/caitlin-trove-co",
            "sessionSpeakerURL": "caitlin-moorman",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "16:20:00"
        },
        {
            "_id": "euEhyXhDvSFhXiQe5",
            "conferencename": "Øredev 2022",
            "sessionDescription": "With extensive polling of workers around the world, the answer is clear: the future of work is choice. For organizations to survive and thrive in the modern hybrid world, we want to be able to “remote first” way: working online as if we were in the office together. \n\nIn this interactive presentation, we'll explore how digital nomads, virtual entrepreneurs, and global organizations are reaching through the screens to collaborate seamlessly at a distance. You will walk away with new ideas for what it means to be “present” at work and how to create that sense of team even when you're virtual.\n\nHow do we ensure that going back to the office doesn’t mean going backwards in time?",
            "sessionKeyTakeAway1": "A brief history of remote working",
            "sessionKeyTakeAway2": "What enables remote working in the new normal",
            "sessionLevel": "10",
            "sessionSpeakerName": "Lisette Sutherland",
            "sessionSpeakersOther": [],
            "sessionTagMain": "People & Teams",
            "sessionTags": [],
            "sessionTitle": "The 1970's called; they want their office model back!",
            "sessionURL": "the-1970-s-called-they-want-their-office-model-back-",
            "sessionType": "40",
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§AgyfqDGL2sPCs4Ycj§7",
            "sessionScheduleRoom": "This way",
            "sessionScheduleSlot": "7",
            "sessionSpeakerImagePuId": "2022_speakers/lisette-lisettesutherland-com",
            "sessionSpeakerURL": "lisette-sutherland",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "16:20:00"
        },
        {
            "_id": "24DAQRqts5AnzvQmR",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Data Science has been a hot topic for some years now, and being a Data Scientist is supposed to be the sexiest job of the century... But what does it mean to be a Data Scientist? Are we building advanced deep learning (AI) models the whole day or are we simply browsing data all day long looking for correlations and black swans? In this session you will hear more about who \"the\" Data Scientist actually is and what just another day in the office means if you are a Data Scientist.",
            "sessionKeyTakeAway1": "What does it mean to be a Data Scientist",
            "sessionKeyTakeAway2": "What does a day in the life of a Data Scientist look like",
            "sessionLevel": "10",
            "sessionSpeakerName": "Jeanine Schoonemann",
            "sessionSpeakersOther": [],
            "sessionTagMain": "Data Science",
            "sessionTags": [],
            "sessionTitle": "Life of a data scientist",
            "sessionTitleShort": "Life of a data scientist",
            "sessionURL": "life-of-a-data-scientist",
            "sessionType": "40",
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§fcC2ASEZqJbm2mzhT§7",
            "sessionScheduleRoom": "Upstairs",
            "sessionScheduleSlot": "7",
            "sessionSpeakerImagePuId": "2022_speakers/j-schoonemann-cmotions-nl",
            "sessionSpeakerURL": "jeanine-schoonemann",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "16:20:00"
        },
        {
            "_id": "fjFQDKXLKmTbfNE3Y",
            "conferencename": "Øredev 2022",
            "sessionDescription": "When faced with the challenges of developing a new product, for a new target audience, on a new platform, using a brand new BaaS (Bank as a Service) which is being constructed as we use it, why not challenge the way we work while we're at it?\n\nThis is the story of how one scrappy little project called Neo is changing how one of the largest banks in the nordics approaches software development.",
            "sessionKeyTakeAway1": "TBD",
            "sessionKeyTakeAway2": "TBD",
            "sessionLevel": "10",
            "sessionSpeakerName": "Johan Öbrink",
            "sessionTagMain": "People & Teams",
            "sessionTags": [
                "Mobile",
                "Architecture",
                "Quality & Test",
                "Security"
            ],
            "sessionTitle": "How to get it right by being wrong all the time",
            "sessionType": "40",
            "sessionURL": "how-to-get-it-right-by-being-wrong-all-the-time",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§SMpH8XCoBZXKY5f9n§7",
            "sessionScheduleRoom": "Wonderland",
            "sessionScheduleSlot": "7",
            "sessionSpeakerImagePuId": "2022_speakers/johan-obrink-seb-se",
            "sessionSpeakerURL": "johan-brink",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "16:20:00"
        },
        {
            "_id": "zAZw3xaDkajvFNbQM",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Imagine if you found yourself with an untapped technical opportunity. What would you do and how would you work in order to deliver as much value as possible to the right people as fast as possible?\n\nIn this talk we will go through how we work with polyglot persistence of massive amounts of streaming data in order to effectively enable use case specialization. We will cover both our technical, as well as user exploration, and will demo how we empower IKEA co-workers to test, learn and improve with the help of realtime, actionable sales insights on a global scale.",
            "sessionKeyTakeAway1": "How one of the world's largest retailers work with massive amounts of real-time data.",
            "sessionKeyTakeAway2": "How you can dare to fail fast and work with continuous discovery in order to deliver more value faster",
            "sessionKeyTakeAway3": "Stories of both failure and success",
            "sessionLevel": "20",
            "sessionSpeakerName": "Mattias Ask",
            "sessionTagMain": "People & Teams",
            "sessionTags": [
                "Cloud",
                "Architecture",
                "Data Science",
                "DevOps"
            ],
            "sessionTitle": "Real-time global sales data - delivering user value through exploration.",
            "sessionType": "40",
            "sessionURL": "real-time-global-sales-data-delivering-user-value-through-exploration-",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§LYCz3myi2sMKuztYB§7",
            "sessionScheduleRoom": "Wrong way",
            "sessionScheduleSlot": "7",
            "sessionSpeakerImagePuId": "2022_speakers/mattias-ask1-ingka-ikea-com",
            "sessionSpeakerURL": "mattias-ask",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "16:20:00"
        },
        {
            "_id": "Y3t6YeMLfi6buHmW2",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Almost everyone wants to do security as part of development, and many teams rely completely on automated tools like static analysis and software composition analysis. Unfortunately, we can't automate security completely with sufficient coverage.\nThreat modeling is one of the most efficient methods to identify security requirements and mitigations needed in your system context. Doing threat modeling as a collaborative effort (developers and security) enables us to scale and build security awareness among team members.\n\nIn this session I will describe the building blocks of modern threat modeling, how to collaborate in each step of threat modeling, and how different types of diagrams (like the C4 model) can be utilized to identify threats and suitable countermeasures. \n\nYou will see how easy it is to get started, and how threat modeling can quickly become an integral part of your development lifecycle.\n\nA question that many teams are asking is - did we do a good job? There are multiple ways to ensure quality and coverage of threat modeling, and we will cover some of them here.",
            "sessionKeyTakeAway1": "You will see how easy it is to get started with threat modeling, and how it can quickly become an integral part of your development lifecycle.",
            "sessionKeyTakeAway2": "You will see how cybersecurity work can be done in collaboration between development and security specialists",
            "sessionLevel": "10",
            "sessionSpeakerName": "Emil Kvarnhammar",
            "sessionTagMain": "Security",
            "sessionTags": [
                "Architecture"
            ],
            "sessionTitle": "Threat modeling is on the rise",
            "sessionType": "40",
            "sessionURL": "threat-modeling-is-on-the-rise",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§mLsppTucSgZEvLukS§8",
            "sessionScheduleRoom": "Downstairs",
            "sessionScheduleSlot": "8",
            "sessionSpeakerImagePuId": "2022_speakers/emil-kvarnhammar-colint-io",
            "sessionSpeakerURL": "emil-kvarnhammar",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "17:20:00"
        },
        {
            "_id": "R2n5yKeXJ8Zaf7L8Q",
            "conferencename": "Øredev 2022",
            "sessionDescription": "If we could only predict the future of the software industry, we could make better investments and decisions. We could waste less resources on technology and processes we know will not last, or at least be conscious in our decisions to choose solutions with a limited life time. It turns out that for data engineering, we can predict the future, because it has already happened. Not in our workplace, but at a few leading companies that are blazing ahead. It has also already happened in the neighbouring field of software engineering, which is two decades ahead of data engineering regarding process maturity.\n\nIn this presentation, we will glimpse into the future of data engineering. Data engineering has gone from legacy data warehouses with stored procedures, to big data with Hadoop and data lakes, on to a new form of modern data warehouses and low code tools aka \"the modern data stack\". Where does it go from here? We will look at the points where data leaders differ from the crowd and combine with observations on how software engineering has evolved, to see that it points towards a new, more industrialised form of data engineering - \"data factory engineering\".",
            "sessionKeyTakeAway1": "What the leading data companies do differently",
            "sessionKeyTakeAway2": "How we can predict data evolution from software evolution",
            "sessionKeyTakeAway3": "What the future of data engineering looks like",
            "sessionKeyTakeAway4": "How you can adapt and invest in future-proof data technology and processes",
            "sessionLevel": "20",
            "sessionSpeakerName": "Lars Albertsson",
            "sessionTagMain": "Data Science",
            "sessionTags": [
                "Architecture",
                "Quality & Test"
            ],
            "sessionTitle": "Data engineering in 10 years",
            "sessionTitleShort": "Data engineering in 10 years",
            "sessionType": "40",
            "sessionURL": "data-engineering-in-10-years",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§Z569Ch8xnaEsMZjir§8",
            "sessionScheduleRoom": "Nowhere",
            "sessionScheduleSlot": "8",
            "sessionSpeakerImagePuId": "2022_speakers/lalle-scling-com",
            "sessionSpeakerURL": "lars-albertsson",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "17:20:00"
        },
        {
            "_id": "4kZLq36Ang9pBqESk",
            "conferencename": "Øredev 2022",
            "sessionDescription": "What happens if you're in a small team and need to refactor a huge JavaScript codebase? What if you have to upgrade your code following the latest ECMAScript specifications? Updating hundreds of thousands of files by hand seems not the best possible option, so here comes the concept of codemods. In this talk, we will see how JavaScript gets interpreted, transformed, and eventually compiled so that refactoring a large codebase won't be a problem anymore.",
            "sessionKeyTakeAway1": "How to approach a large-scale refactor",
            "sessionKeyTakeAway2": "What are the risks and solutions for that task",
            "sessionLevel": "20",
            "sessionSpeakerName": "Michele Riva",
            "sessionTagMain": "Web",
            "sessionTags": [],
            "sessionTitle": "Refactoring large JavaScript codebases",
            "sessionType": "40",
            "sessionURL": "refactoring-large-javascript-codebases",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§eWnqdASsnFYcsWrZC§8",
            "sessionScheduleRoom": "Somewhere",
            "sessionScheduleSlot": "8",
            "sessionSpeakerImagePuId": "2022_speakers/michele-riva-nearform-com",
            "sessionSpeakerURL": "michele-riva",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "17:20:00"
        },
        {
            "_id": "rzoNzQdAvrmoNYrE7",
            "conferencename": "Øredev 2022",
            "sessionDescription": "With DevOps being a state of the art mindset we find ourselves with autonomous teams who can take full ownership and not only develops features but also follow up on their usage, put them in production and fix them when they break. Without operations teams, the develops need to care about things such as logging, metrics and container orchestration. How can we get our developers to spend more time on building their product and less time on all the tooling? Join this session to learn how Platform Engineering is the key to make DevOps work in real life!",
            "sessionKeyTakeAway1": "You will learn how to keep the DevOps culture and still focusing on delivering product value",
            "sessionKeyTakeAway2": "You will learn about Platform Engineering and why you should care!",
            "sessionLevel": "20",
            "sessionSpeakerName": "Jessica Andersson",
            "sessionSpeakersOther": [],
            "sessionTagMain": "DevOps",
            "sessionTags": [
                "Cloud",
                "People & Teams"
            ],
            "sessionTitle": "DevOps meets reality",
            "sessionTitleShort": "DevOps meets reality",
            "sessionType": "40",
            "sessionURL": "devops-meets-reality",
            "sessionKeyTakeAway3": "You will gain insights in navigating the minefield of autonomy and paved roads",
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§AgyfqDGL2sPCs4Ycj§8",
            "sessionScheduleRoom": "This way",
            "sessionScheduleSlot": "8",
            "sessionSpeakerImagePuId": "2022_speakers/jesandeit-gmail-com",
            "sessionSpeakerURL": "jessica-andersson",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "17:20:00"
        },
        {
            "_id": "8arDKn5PnjCX5MQBn",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Serverless is great for a lot of use cases. Some more than others. But did you know that you could create solutions that need state using Azure Functions? We can now do this using the new feature of Azure Durable Functions called Entity functions!\n\nIn this talk, we will look at this new feature together! \n\nI will not just talk about Entity Functions and advanced usage of Azure Durable Functions. We will put it to the test!\n\nWe will live code a very simple chatbot for Telegram that will store our state and conversation with the user. And you, the attendee, are very much welcome to pick up your phone and spam the chatbot as much as you like as it comes along!",
            "sessionKeyTakeAway1": "You will learn how to use the new Entity Functions to store state.",
            "sessionKeyTakeAway2": "You will get a better understanding of some of the inner workings of Azure Durable Functions.",
            "sessionKeyTakeAway3": "You will know how to get a simple chatbot up using only Azure Functions.",
            "sessionKeyTakeAway4": "You will have some fun trying to break the chatbot live while we code it!",
            "sessionLevel": "20",
            "sessionSpeakerName": "Karl Løland",
            "sessionTagMain": "Cloud",
            "sessionTags": [],
            "sessionTitle": "Playing with serverless and state - Let's create a serverless chatbot!",
            "sessionType": "40",
            "sessionURL": "playing-with-serverless-and-state-let-s-create-a-serverless-chatbot-",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§fcC2ASEZqJbm2mzhT§8",
            "sessionScheduleRoom": "Upstairs",
            "sessionScheduleSlot": "8",
            "sessionSpeakerImagePuId": "2022_speakers/karl-syvert-myerart-net",
            "sessionSpeakerURL": "karl-l-land",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "17:20:00"
        },
        {
            "_id": "74sz2QhT7EhcpvEws",
            "conferencename": "Øredev 2022",
            "sessionDescription": "The World Economic Forum in its Global Risks Perception Survey 2022, published the Global Risks Horizon that rates - Cybersecurity failure and Digital inequality as the Clear and present dangers  / Short-term risks (0 – 2 years). IT infrastructure breakdown, Cybersecurity failure as the Medium-term risks (2 – 5 years) and Adverse tech advances as Existential threats / Long-term risks (5 – 10 years).\n\nUntil last year - Tech governance failure was also a medium term risk. On one hand we have hi-tech advances happening where exclusive software is being built to support fancy projects like reaching and exploring mars and making space travels available for non-astronaut individuals who can pay for the same. And there are cryptos, and bitcoins and VR. And AI forever!\n\nOn the other hand there are mindful technologies evolving to serve sustainable development use cases in the area of climate tech, agri tech, edtech, health tech, fintech…etc trying to make the world a safer place for all in a very inclusive way.\n\nThere are businesses preparing to serve the next billion users who will move out of poverty and have economic access to spend on technology for the first time.\n\nHow does this change what developers do? Do we understand the new users of these new technologies as to what would quality mean for them? Are we as software developers and testers geared up to meet their needs and test for our customers of the Next economy?\n\nLet’s learn what the world thinks could be technology risks and how we as developers align better to the new world view.",
            "sessionKeyTakeAway1": "How is technology shaping up for the diverse set of users?",
            "sessionKeyTakeAway2": "Key quality factors that the new age software are looking for.",
            "sessionKeyTakeAway3": "Redesigning the strategy (including team and tools) for the “next” age software.",
            "sessionLevel": "20",
            "sessionSpeakerName": "Smita Mishra",
            "sessionTagMain": "Quality & Test",
            "sessionTags": [
                "Mobile",
                "Data Science"
            ],
            "sessionTitle": "Building software for the “Next” Economy",
            "sessionTitleShort": "With the changing risks perception around environmental & societal risks,  & technology governance failure being seen as risk, how are the developers geared up for the technology of the new world.",
            "sessionType": "40",
            "sessionURL": "building-software-for-the-next-economy",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§SMpH8XCoBZXKY5f9n§8",
            "sessionScheduleRoom": "Wonderland",
            "sessionScheduleSlot": "8",
            "sessionSpeakerImagePuId": "2022_speakers/sm-fandoro-com",
            "sessionSpeakerURL": "smita-mishra",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "17:20:00"
        },
        {
            "_id": "wz8NoNrqvcZSDmx4F",
            "conferencename": "Øredev 2022",
            "sessionDescription": "2022 saw a lot of chatter about what the next 'revolution' in technology was supposed to be. Was it web3? Or NFTs? Or maybe it was the Metaverse. But it was none of these. While the industry was loudly debating the practicality and morality of NFTs, there was another technology revolution happening in the background, one that was eminently foreseeable but yet went largely unexplored. We've seen governments hire Tiktok influencers to shape policy perspectives of the next generation. We've seen a squadron of IT nerds almost single-handedly defend against the massive onslaught of the Russian army outside Kyiv. And we've seen the world's premiere law enforcement agencies be easily outmanoeuvred by crime-fighting sleuths. The revolution is here, and it's staring us in the face. In this talk, I'll tell you why this revolution will quietly succeed while others will loudly fail.",
            "sessionKeyTakeAway1": "You'll learn how revolutions actually begin.",
            "sessionKeyTakeAway2": "You'll learn what revolutions mean in the long run.",
            "sessionKeyTakeAway3": "You'll learn what the real revolutions in tech are.",
            "sessionKeyTakeAway4": "You'll learn how to create the conditions for revolution, but not how to control them.",
            "sessionLevel": "10",
            "sessionSpeakerName": "Emily Gorcenski",
            "sessionTagMain": "Keynote",
            "sessionTags": [
                "Web",
                "Polyglot & Fringe"
            ],
            "sessionTitle": "Through the Looking Glass, or the Tech Revolution that Is",
            "sessionType": "40",
            "sessionURL": "through-the-looking-glass-or-the-tech-revolution-that-is",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§SMpH8XCoBZXKY5f9n§9",
            "sessionScheduleRoom": "Wonderland",
            "sessionScheduleSlot": "9",
            "sessionSpeakerImagePuId": "2022_speakers/egorcens-thoughtworks-com",
            "sessionSpeakerURL": "emily-gorcenski",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "18:30:00"
        },
        {
            "_id": "CYnXDKFMtdRkT7K56",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Just sit back and enjoy the show!",
            "sessionKeyTakeAway1": "How nerdy can one be?",
            "sessionKeyTakeAway2": "You can be technical and entertaining!",
            "sessionLevel": "10",
            "sessionSpeakerName": "Matt Parker",
            "sessionSpeakersOther": [],
            "sessionTagMain": "Entertainment",
            "sessionTags": [],
            "sessionTitle": "Stand up + Maths",
            "sessionType": "40",
            "sessionURL": "stand-up-maths",
            "sessionScheduleDay": "3",
            "sessionScheduleId": "§BY2nw4rwaXrEzuqgg§SMpH8XCoBZXKY5f9n§91",
            "sessionScheduleRoom": "Wonderland",
            "sessionScheduleSlot": "91",
            "sessionSpeakerImagePuId": "2022_speakers/matt-standupmaths-com",
            "sessionSpeakerURL": "matt-parker",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "20:30:00"
        },
        {
            "_id": "k3h9yW5SZ2Zmq2Bu4",
            "conferencename": "Øredev 2022",
            "sessionDescription": "An ethical uprising has taken hold within the technology industry: a generation is turning its back on exploitative work in search of meaning and social impact. But like most protest movements, not everything has gone smoothly.    \n\nTechnologists want to have more positive impacts on society, but most lack the training and know-how about what responsible innovation means in practice. Meanwhile, some business leaders eye ethics with suspicion and have punished the movement’s loudest voices for speaking up. At the heart of the uncertainty lies a miasma of misconceptions: that ethics is subjective, slow, and vague.\n\nThis session will dispel these myths. It is true, of course, that ethics isn’t easy. There’s rarely one clear answer, and it involves asking uncomfortable questions. But ethics is actionable and, above all, deeply necessary. Take it seriously and we don’t just avoid risks: we also create better products, services, and worlds.\n\nAs the last embers of the industrial growth age die out, we urgently need more responsible, sustainable, and ethical approaches to building technology. Software engineers have tremendous power to help forge new futures. Let’s use that power for good.",
            "sessionKeyTakeAway1": "The three waves of tech ethics to date, and what might come next.",
            "sessionKeyTakeAway2": "Why ‘Do no harm’ isn’t enough.",
            "sessionKeyTakeAway3": "How engineers can live up to their ethical responsibilities across the development lifecycle.",
            "sessionLevel": "20",
            "sessionSpeakerName": "Cennydd Bowles",
            "sessionTagMain": "Keynote",
            "sessionTags": [
                "People & Teams"
            ],
            "sessionTitle": "The Ethical Engineer",
            "sessionTitleShort": "The Ethical Engineer",
            "sessionType": "40",
            "sessionURL": "the-ethical-engineer",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "4",
            "sessionScheduleId": "§F5EkNRS32gz2MfwBW§SMpH8XCoBZXKY5f9n§1",
            "sessionScheduleRoom": "Wonderland",
            "sessionScheduleSlot": "1",
            "sessionKeyTakeAway4": "How developers can challenge unethical decisions and push for better outcomes and workplaces.",
            "sessionSpeakerImagePuId": "2022_speakers/cennydd-nownext-studio",
            "sessionSpeakerURL": "cennydd-bowles",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "09:00:00"
        },
        {
            "_id": "2asHpPapDGJQd74gM",
            "sessionTitle": "Let's Flutter for 40 minutes!",
            "sessionTitleShort": "40 minutes Flutter live coding",
            "sessionLevel": "20",
            "sessionType": "40",
            "sessionTagMain": "Mobile",
            "sessionTags": [
                "Web"
            ],
            "sessionKeyTakeAway1": "You'll Learn flutter and dart fundamentals",
            "sessionKeyTakeAway2": "You'll Learn how to develop fast with flutter",
            "sessionKeyTakeAway3": "You'll Create a beautiful app in 40 minutes",
            "sessionKeyTakeAway4": "You'll be ready for taking Flutter as your next tech after the talk!",
            "sessionDescription": "Flutter is a cross-platform, mobile development framework created by Google. Flutter allows developers to create beautiful apps on several platforms from a single codebase with user-centric design in mind. Flutter is well-known for its productive and fast development experiences which I will prove by doing live code.\n\nIn this session, I will walk you through the fundamentals of Flutter and Dart that make you ready for building your first Flutter app with ease and comfort.",
            "conferencename": "Øredev 2022",
            "sessionURL": "let-s-flutter-for-40-minutes-",
            "sessionSpeakerName": "Majid Hajian",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "4",
            "sessionScheduleId": "§F5EkNRS32gz2MfwBW§mLsppTucSgZEvLukS§2",
            "sessionScheduleRoom": "Downstairs",
            "sessionScheduleSlot": "2",
            "sessionSpeakerImagePuId": "2022_speakers/mhadaily-gmail-com",
            "sessionSpeakerURL": "majid-hajian",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "10:30:00"
        },
        {
            "_id": "yrjMFCgYvF2CeynWZ",
            "conferencename": "Øredev 2022",
            "sessionDescription": "There are many buzzwords related to the data field. Some vanish as soon as they came, but some persist and becomes an integral part for companies who are serious about becoming data driven.\n\nOne of these has been Analytics Engineering, which in just a few years become a central role on modern data teams.\n\nWhy is that? And how does great analytics engineering look like?",
            "sessionKeyTakeAway1": "What Analytics Engineering is",
            "sessionKeyTakeAway2": "And why it's been a role many companies invest in",
            "sessionKeyTakeAway3": "How to succeed in the role",
            "sessionLevel": "20",
            "sessionSpeakerName": "Max Dyrhage",
            "sessionTagMain": "Data Science",
            "sessionTags": [],
            "sessionTitle": "Democratize your data with Analytics Engineering",
            "sessionType": "40",
            "sessionURL": "democratize-your-data-with-analytics-engineering",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "4",
            "sessionScheduleId": "§F5EkNRS32gz2MfwBW§Z569Ch8xnaEsMZjir§2",
            "sessionScheduleRoom": "Nowhere",
            "sessionScheduleSlot": "2",
            "sessionSpeakerImagePuId": "2022_speakers/max-signific-se",
            "sessionSpeakerURL": "max-dyrhage",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "10:30:00"
        },
        {
            "_id": "dxhEdDBQGoS7soThE",
            "conferencename": "Øredev 2022",
            "sessionDescription": "WebGPU - WebGL successor, completely new API to talk to GPU from browsers. Why do tech giants such as Intel, Microsoft, Google and Apple work together to roll it out? How is it better than WebGL and what it brings to the Web platform?",
            "sessionKeyTakeAway1": "Why are we getting another standard in place of WebGL?",
            "sessionKeyTakeAway2": "How WebGPU is better?",
            "sessionKeyTakeAway3": "Is it more performant? How much?",
            "sessionKeyTakeAway4": "What are practical applications for WebGPU?",
            "sessionLevel": "20",
            "sessionSpeakerName": "Denis Radin",
            "sessionTagMain": "Web",
            "sessionTags": [],
            "sessionTitle": "What WebGPU means for Web platform?",
            "sessionTitleShort": "What WebGPU means for Web platform?",
            "sessionType": "40",
            "sessionURL": "what-webgpu-means-for-web-platform-",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "4",
            "sessionScheduleId": "§F5EkNRS32gz2MfwBW§eWnqdASsnFYcsWrZC§2",
            "sessionScheduleRoom": "Somewhere",
            "sessionScheduleSlot": "2",
            "sessionSpeakerImagePuId": "2022_speakers/denis-radin-gmail-com",
            "sessionSpeakerURL": "denis-radin",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "10:30:00"
        },
        {
            "_id": "iHNjmyvzqHZGnWNhh",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Jeff Handley is an engineering manager on Microsoft’s .NET Libraries team, which delivers the lowest level managed code that all other .NET code is built on. Jeff will present some highlights of what’s new in .NET 7, due to release in November 2022. Features span Numerics, Cryptography, JSON, Compression, Reflection, and more.",
            "sessionKeyTakeAway1": "What is .NET 7 and how does it relate to .NET Core and .NET Framework?",
            "sessionKeyTakeAway2": "What are some of the exciting new APIs in .NET 7?",
            "sessionKeyTakeAway3": "How do I submit feature requests for .NET 8?",
            "sessionLevel": "10",
            "sessionSpeakerName": "Jeff Handley",
            "sessionTagMain": ".NET",
            "sessionTags": [],
            "sessionTitle": "Updates from the .NET Libraries Team",
            "sessionType": "40",
            "sessionURL": "updates-from-the-net-libraries-team",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "4",
            "sessionScheduleId": "§F5EkNRS32gz2MfwBW§AgyfqDGL2sPCs4Ycj§2",
            "sessionScheduleRoom": "This way",
            "sessionScheduleSlot": "2",
            "sessionSpeakerImagePuId": "2022_speakers/jeff-jeffhandley-com",
            "sessionSpeakerURL": "jeff-handley",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "10:30:00"
        },
        {
            "_id": "opTpL8wnCcu3MjqpR",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Jakarta EE 10 is here with lots of new features and improvements. In this session, I will go through most of these features one by one with live coding examples of how to use them. As an example, you will learn how to adjust your applications to take advantage of the new CDI Lite specification in order to allow for native compilation. And how to use the brand new Java SE Bootstrapping API for Jakarta RESTful Web Services.\n\nBy attending this session, you will get the full overview of what Jakarta EE 10 brings to the table, including the brand new Jakarta EE Core Profile that targets smaller runtimes. You will also get a sneak peek into what to expect beyond Jakarta EE 10.",
            "sessionKeyTakeAway1": "How to leverage the power of Jakarta EE 10",
            "sessionKeyTakeAway2": "How to migrate from previous versions",
            "sessionLevel": "20",
            "sessionSpeakerName": "Ivar Grimstad",
            "sessionTagMain": "JVM",
            "sessionTags": [
                "Cloud",
                "Architecture"
            ],
            "sessionTitle": "Attention Java Developers -  Everything YOU need to Know About Jakarta EE 10",
            "sessionURL": "attention-java-developers-everything-you-need-to-know-about-jakarta-ee-10",
            "sessionType": "40",
            "sessionTitleShort": "All about Jakarta EE 10",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "4",
            "sessionScheduleId": "§F5EkNRS32gz2MfwBW§fcC2ASEZqJbm2mzhT§2",
            "sessionScheduleRoom": "Upstairs",
            "sessionScheduleSlot": "2",
            "sessionKeyTakeAway3": "What to expect from Jakarta EE in the future",
            "sessionSpeakerImagePuId": "2022_speakers/ivar-grimstad-gmail-com",
            "sessionSpeakerURL": "ivar-grimstad",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "10:30:00"
        },
        {
            "_id": "id5iAupvtPmiZZurC",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Organizations that rely on software operate in an ever-changing environment. As they deal with increasing complexity companies are waking up to the hangovers left by installing agile frameworks and one size fits all models. Instead, they are looking for ways to organically evolve to meet demands that change at a high pace. They are trying to address how to get their employees more involved and provide them with enough autonomy to be productive. To understand when the needs of the organization change and to optimize for flow. How to apply the right thing, at the right time, and how to build a learning organization.\nJoin us for a panel where we will discuss the shift, what it means to team members and leaders, and why this change is necessary for your organization to stay competitive.\nHeidi Helfand has written the book Dynamic Reteaming.\nChris Smith shares experiences from years of reteaming and self-selection.\nSusanne Kaiser supports organizations building socio-technical systems based on Wardley mapping, team topologies, and DDD.\nPanel moderated by Jakob Wolman",
            "sessionKeyTakeAway1": "Why there is no one model for organizational design",
            "sessionKeyTakeAway2": "Principles and tools for creating an inclusive organizations where engineers thrive",
            "sessionLevel": "20",
            "sessionSpeakerName": "Heidi Helfand",
            "sessionSpeakersOther": [
                "4tvrzvLf6rsEW6nLt",
                "msuM9hHPPbiSAxC2G"
            ],
            "sessionTagMain": "People & Teams",
            "sessionTags": [],
            "sessionTitle": "Why one model can’t fit all - creating fulfilling engineering organizations - panel",
            "sessionType": "40",
            "sessionURL": "why-one-model-can-t-fit-all-creating-fulfilling-engineering-organizations-panel",
            "sessionScheduleDay": "4",
            "sessionScheduleId": "§F5EkNRS32gz2MfwBW§SMpH8XCoBZXKY5f9n§2",
            "sessionScheduleRoom": "Wonderland",
            "sessionScheduleSlot": "2",
            "sessionSpeakerImagePuId": "2022_speakers/heidi-helfand-gmail-com",
            "sessionSpeakerURL": "heidi-helfand",
            "otherSpeakersShow": [
                {
                    "_id": "4tvrzvLf6rsEW6nLt",
                    "speakerFirstName": "Chris",
                    "speakerLastName": "Smith",
                    "speakerURL": "chris-smith",
                    "speakerImagePuId": "2022_speakers/chris-smith-red-gate-com"
                },
                {
                    "_id": "msuM9hHPPbiSAxC2G",
                    "speakerFirstName": "Susanne",
                    "speakerLastName": "Kaiser",
                    "speakerURL": "susanne-kaiser",
                    "speakerImagePuId": "2022_speakers/susanne-susannekaiser-net"
                }
            ],
            "sessionScheduleTime": "10:30:00"
        },
        {
            "_id": "D6raEb7HWcN9B6CqE",
            "conferencename": "Øredev 2022",
            "sessionDescription": "In the words of the great philosopher Mike Tyson: \"Everyone has a plan until they get punched in the mouth!\" This is what it is like beting under attack. This is the story of what we did and how we worked to handle the crisis. The focus is not on technical solutions but rather on crisis management, what we did to keep functioning as a company and how worked to earn trust from customers globally. The beauty of the story is that most actions can be easily copied by others with (hopefully) good results!",
            "sessionKeyTakeAway1": "No-one chooses to get into a crisis – but you choose your response. We will tell you about ours.",
            "sessionKeyTakeAway2": "Our crisis management was based on strong core values and transparency – it proved to be a good method",
            "sessionKeyTakeAway3": "You will get our answer to the question: how does anyone remain trustworthy despite the attack?",
            "sessionKeyTakeAway4": "All that went well was prepared years before the attack – and refined every day. This is the story of what to do.",
            "sessionLevel": "10",
            "sessionSpeakerName": "Jonas Hansson",
            "sessionTagMain": "Security",
            "sessionTags": [],
            "sessionTitle": "Inside a cyberattack",
            "sessionTitleShort": "Inside a cyberattack",
            "sessionType": "40",
            "sessionURL": "inside-a-cyberattack",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "4",
            "sessionScheduleId": "§F5EkNRS32gz2MfwBW§LYCz3myi2sMKuztYB§2",
            "sessionScheduleRoom": "Wrong way",
            "sessionScheduleSlot": "2",
            "sessionSpeakerImagePuId": "2022_speakers/jonas-hansson-axis-com",
            "sessionSpeakerURL": "jonas-hansson",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "10:30:00"
        },
        {
            "_id": "zNX7qtAjuswsHat2r",
            "conferencename": "Øredev 2022",
            "sessionDescription": "WebAssembly, one of the fastest-growing cloud-native trends, is\nappearing everywhere - on the server and the edge. WebAssembly is\nembedded into platforms such as Envoy where it offers extensibility\nand in projects such as Krustlet that allow developers to run\nWebAssembly workloads in their Kubernetes clusters.\n\nIn this talk, Adrian dives into the whys of WebAssembly and discusses\nthe benefits, the challenges, and what can we look forward to in the\nfuture.",
            "sessionKeyTakeAway1": "What WebAssembly is",
            "sessionKeyTakeAway2": "How WebAssembly relates to Java",
            "sessionKeyTakeAway3": "Why WebAssembly fits in server-side",
            "sessionKeyTakeAway4": "How to embed WebAssembly in Golang applications",
            "sessionLevel": "20",
            "sessionSpeakerName": "Adrian Cole",
            "sessionTagMain": "Web",
            "sessionTags": [
                "Architecture",
                "Polyglot & Fringe",
                "Security",
                "DevOps"
            ],
            "sessionTitle": "Why should you care about WebAssembly?",
            "sessionType": "40",
            "sessionURL": "why-should-you-care-about-webassembly-",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "4",
            "sessionScheduleId": "§F5EkNRS32gz2MfwBW§mLsppTucSgZEvLukS§3",
            "sessionScheduleRoom": "Downstairs",
            "sessionScheduleSlot": "3",
            "sessionSpeakerImagePuId": "2022_speakers/adrian-tetrate-io",
            "sessionSpeakerURL": "adrian-cole",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "11:30:00"
        },
        {
            "_id": "eCv7Anbeg27yMuieR",
            "conferencename": "Øredev 2022",
            "sessionDescription": "On good days, data teams get to deliver great news - strong performance, insights that supercharge how the team can manage the business, a new data product that delivers great results. But we also often have to deliver the bad news - tracking to miss targets, identifying that a pet project isn't delivering results, a degradation in model performance. This session will provide practical tips to improve how you communicate bad news to build trust with your stakeholders and drive improved organizational outcomes.",
            "sessionKeyTakeAway1": "You will learn how to turn bad news into positive organizational outcomes",
            "sessionKeyTakeAway2": "You will have a better understanding of how to leverage the context you operate in to improve your communication",
            "sessionKeyTakeAway3": "You will be able to ensure your message is clear and lands with stakeholders",
            "sessionLevel": "20",
            "sessionSpeakerName": "Caitlin Moorman",
            "sessionTagMain": "Data Science",
            "sessionTags": [
                "People & Teams"
            ],
            "sessionTitle": "Becoming a Good Bearer of Bad News",
            "sessionType": "40",
            "sessionURL": "becoming-a-good-bearer-of-bad-news",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "4",
            "sessionScheduleId": "§F5EkNRS32gz2MfwBW§Z569Ch8xnaEsMZjir§3",
            "sessionScheduleRoom": "Nowhere",
            "sessionScheduleSlot": "3",
            "sessionSpeakerImagePuId": "2022_speakers/caitlin-trove-co",
            "sessionSpeakerURL": "caitlin-moorman",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "11:30:00"
        },
        {
            "_id": "GXBLsdWBnCLTZDgzz",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Every change of state in an enterprise is qualified as an ‘event’. Like synchronous REST APIs, it is possible to elevate asynchronous, event-centric interactions as event APIs to streamline business processes and create positive customer experiences. Enabling and exposing events in an enterprise as event API products can benefit internal and external stakeholders. To accomplish that, an enterprise needs the ability to: \n* Harness and expose digital value as events  \n* Bundle and document events for sharing and automation using specifications such as AsyncAPI \n* Release the event API product to the world \n* Manage event API products using an event management platform that simplifies the entire event lifecycle \n\nAdoption of event API products will benefit from the experience of working with synchronous APIs, existing standards, and API management systems – eventually making it an integral part of complex problem-solving.  \n\nThis talk includes a demonstration of building and consuming an event API product using Solace PubSub+ and AsyncAPI.",
            "sessionKeyTakeAway1": "How & Why organizations are using Event-Driven Architecture (EDA)",
            "sessionKeyTakeAway2": "What are Event API Products?",
            "sessionKeyTakeAway3": "How Event API Products enable your organization to get the move value out of it's EDA",
            "sessionLevel": "20",
            "sessionSpeakerName": "Marc DiPasquale",
            "sessionTagMain": "Architecture",
            "sessionTags": [],
            "sessionTitle": "Event API Products: Maximizing the Value of Your Event-Driven Architecture",
            "sessionType": "40",
            "sessionURL": "event-api-products-maximizing-the-value-of-your-event-driven-architecture",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "4",
            "sessionScheduleId": "§F5EkNRS32gz2MfwBW§eWnqdASsnFYcsWrZC§3",
            "sessionScheduleRoom": "Somewhere",
            "sessionScheduleSlot": "3",
            "sessionSpeakerImagePuId": "2022_speakers/marc-dipasquale-solace-com",
            "sessionSpeakerURL": "marc-dipasquale",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "11:30:00"
        },
        {
            "_id": "bvZ3JAPBAzKfAEpQQ",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Today it’s common for company leaders to express a desire to be more agile, and many embark on expensive change journeys, to make their teams more agile.\nAfter years on this journey fraught with “resistance” and lots of change, and yet seldom able to show results that are meaningful to customers or the business\n\nPart of the problem is the core assumption that the problems, and therefore solutions exist at the team level.\nMy experience is that to delight customers, collaboration is required between teams and departments. This focusing on the parts (individuals and teams) rarely improves the whole, in ways customers will appreciate or pay for.\n\nWe’ll explore this through three lenses.\nSystems - How building effective interaction between teams produces more effective results\nScience - How to Improve our understanding of what works and what doesn’t \nSapiens - How creating a healthy environment unlocked our potential.",
            "sessionKeyTakeAway1": "Interactions BETWEEN the parts of an org, are often more important than the parts themselves",
            "sessionKeyTakeAway2": "How to shift to a move evidence based, scientific approach to improvement and org design",
            "sessionKeyTakeAway3": "Important tips on the human side of change, and how vital it is for success",
            "sessionLevel": "20",
            "sessionSpeakerName": "Cliff Hazell",
            "sessionTagMain": "People & Teams",
            "sessionTags": [],
            "sessionTitle": "Beyond Copy Paste Agile -  Building the missing links between Strategy and Operations",
            "sessionTitleShort": "Beyond Copy Paste Agile",
            "sessionType": "40",
            "sessionURL": "beyond-copy-paste-agile-building-the-missing-links-between-strategy-and-operations",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "4",
            "sessionScheduleId": "§F5EkNRS32gz2MfwBW§AgyfqDGL2sPCs4Ycj§3",
            "sessionScheduleRoom": "This way",
            "sessionScheduleSlot": "3",
            "sessionSpeakerImagePuId": "2022_speakers/cliff-flightlevels-io",
            "sessionSpeakerURL": "cliff-hazell",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "11:30:00"
        },
        {
            "_id": "GuHhND2ZBjzvhBwx4",
            "conferencename": "Øredev 2022",
            "sessionDescription": "The sad truth is that we build software systems that are hard to change, and when we change them, they break. As usual, it's because we've forgotten that our forebears have invented the building blocks we need to build living systems: actors and hypermedia. Actors allow us to model resources as living, independent, concurrent things. Hypermedia enables dynamic, organic systems by providing a generic mechanism for creating associations between the live resources and presenting choices for state transitions to clients. In this talk, I'll combine the two and show how you can build living systems using hypermedia actors. To compensate for using old ideas to fix today's problems, I'll use modern technology for the implementation.",
            "sessionKeyTakeAway1": "You will learn how useful the actor model is in modelling concurrent systems",
            "sessionKeyTakeAway2": "You will learn how useful hypermedia is in driving application behavior through affordances",
            "sessionLevel": "20",
            "sessionSpeakerName": "Einar Høst",
            "sessionTagMain": ".NET",
            "sessionTags": [],
            "sessionTitle": "Hypermedia actors in F#",
            "sessionType": "40",
            "sessionURL": "hypermedia-actors-in-f-",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "4",
            "sessionScheduleId": "§F5EkNRS32gz2MfwBW§fcC2ASEZqJbm2mzhT§3",
            "sessionScheduleRoom": "Upstairs",
            "sessionScheduleSlot": "3",
            "sessionSpeakerImagePuId": "2022_speakers/einarwh-gmail-com",
            "sessionSpeakerURL": "einar-h-st",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "11:30:00"
        },
        {
            "_id": "rEQYGuW8BzqCFNL6z",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Included in the JDK installation are a lot of handy tools for Java developers, from java, jshell and jcmd to jfr and jdeprscan. These allow you to analyze a running JVM, generate JRE's, run Java source code and much more. In this talk I would like to present a number of these tools with practical examples and thus expand the toolbox of the participants. With the command line tools, many tasks can be automated and executed more efficiently, leaving more time for the exciting things in developer life.",
            "sessionKeyTakeAway1": "How to use JDK command line tools",
            "sessionKeyTakeAway2": "What you get out of JShell, Jcmd, JFR, etc.",
            "sessionLevel": "10",
            "sessionSpeakerName": "Michael Hunger",
            "sessionTagMain": "JVM",
            "sessionTags": [],
            "sessionTitle": "Easing the daily grind with the awesome JDK command line tools",
            "sessionType": "40",
            "sessionURL": "easing-the-daily-grind-with-the-awesome-jdk-command-line-tools",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "4",
            "sessionScheduleId": "§F5EkNRS32gz2MfwBW§SMpH8XCoBZXKY5f9n§3",
            "sessionScheduleRoom": "Wonderland",
            "sessionScheduleSlot": "3",
            "sessionSpeakerImagePuId": "2022_speakers/michael-hunger-neo4j-com",
            "sessionSpeakerURL": "michael-hunger",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "11:30:00"
        },
        {
            "_id": "fsMyxtEowANHBmN7u",
            "conferencename": "Øredev 2022",
            "sessionDescription": "We will all live in a virtual universe - a Metaverse - at some point. It's not a matter of if but when this new reality will hit us.\nUnfortunately, it's not likely to happen anytime soon. A timeframe of ten to fifteen years is not unlikely. At least until it's widely accepted. Headsets, networks, and computing power need to improve tenfold before mainstream adoption.\n\nWith this in mind, a more interesting question to ask is: what is the state of the Metaverse today? Does it even exist, and what benefit can it give us?\n\nThe only way to find answers to the above questions is to spend time in the current version of the Metaverse, which is Virtual Reality. A lot of time.\n\nIn this session, the speaker will go through the - hard-earned - knowledge gained from working full-time in virtual reality.\n\nSome questions answered in this session are:\n* What is the Metaverse?\n* Does it exist, and if so, in what shape?\n* What's it like working full-time in VR?\n* Can highly interactive workshops be conducted in VR?\n* As a developer, does it make sense to use VR?\n* What are the other benefits we can expect from the Metaverse?\n\nThis session is for anyone interested in future technology, the Metaverse, and virtual reality.",
            "sessionKeyTakeAway1": "You will know all about the Metaverse and how you can take advantage of it today.",
            "sessionKeyTakeAway2": "The psychology behind VR. Areas that are likely to impact us in the future. What it's like working full-time in VR",
            "sessionKeyTakeAway3": "You can go home and start building, or contribute",
            "sessionLevel": "10",
            "sessionSpeakerName": "Pär Sikö",
            "sessionTagMain": "AR & VR",
            "sessionTags": [],
            "sessionTitle": "A month entrenched in the Metaverse",
            "sessionTitleShort": "A month entrenched in the Metaverse",
            "sessionType": "40",
            "sessionURL": "a-month-entrenched-in-the-metaverse",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "4",
            "sessionScheduleId": "§F5EkNRS32gz2MfwBW§LYCz3myi2sMKuztYB§3",
            "sessionScheduleRoom": "Wrong way",
            "sessionScheduleSlot": "3",
            "sessionSpeakerImagePuId": "2022_speakers/par-siko-gmail-com",
            "sessionSpeakerURL": "p-r-sik-",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "11:30:00"
        },
        {
            "_id": "PwkuXhW48M28szsTj",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Does the fear of increased costs keep you from moving your on-premise solution to the cloud? Or do you feel you are paying too much for your current cloud solution?\n \nI am a cheapskate, and I thoroughly enjoy paying as little as possible on my cloud services usage. Microsoft Azure is a great platform to create your next cloud-native solution. But maybe you have heard or felt that it could be somewhat expensive? Let us change this!\n \nThere are a whole lot of services to choose from on Microsoft Azure. Some are very expensive, and some are cheap. The same services can be cheap for higher usage but expensive for low usage and vice-versa. So how do you know which services to use? Is the service that advertises a large generous free tier, or the one that has just received a new consumption-based pricing model, the cheapest service for you in the long run? And how do I set up my solution so that it is as affordable as possible for my usage?\n \nIn this talk, we will compare some of the more known services against each other using my \"Stinginess-scale.\" I will show some simple changes that can be done to some of the more known reference architectures to make them cheaper. And share some of my best tips & tricks on architecting affordable solutions on Microsoft Azure.\n \nI hope you will leave this talk inspired and with new knowledge on how to save money on your current or next cloud solution!",
            "sessionKeyTakeAway1": "You will be able to create cheaper solutions on Azure",
            "sessionKeyTakeAway2": "You will learn which services on Azure that can compliment each other very good and save you cost as well",
            "sessionKeyTakeAway3": "You will learn that some of Azures services are very expensive and learn of cheaper alternatives",
            "sessionLevel": "20",
            "sessionSpeakerName": "Karl Løland",
            "sessionTagMain": "Cloud",
            "sessionTags": [
                "Architecture"
            ],
            "sessionTitle": "A cheapskate's guide to Azure",
            "sessionType": "40",
            "sessionURL": "a-cheapskate-s-guide-to-azure",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "4",
            "sessionScheduleId": "§F5EkNRS32gz2MfwBW§mLsppTucSgZEvLukS§4",
            "sessionScheduleRoom": "Downstairs",
            "sessionScheduleSlot": "4",
            "sessionSpeakerImagePuId": "2022_speakers/karl-syvert-myerart-net",
            "sessionSpeakerURL": "karl-l-land",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "13:00:00"
        },
        {
            "_id": "9JkssiinnqW4FkM5X",
            "conferencename": "Øredev 2022",
            "sessionDescription": "“VULNERABILITY!” Cries the CI-pipeline for the 124th time this week. How fast do developers learn to ignore this notification? Security alerts are constantly increasing, but how many are actually warnings about real threats? If we don’t respond to them, are they really making us more secure? We’ve all heard the story of the boy who cried wolf, and we know that the worst possible scenario for a tool is to become that boy - a never ending stream of alerts that no one cares about. Why is this such a complex issue in open source security, and what are some innovative ways to solve it? How do we make sure that we only alert you when the wolf is really there? In this talk, we look closely at the different levels of true positives and dive deep into the cry wolf paradox in the world of open source security.",
            "sessionKeyTakeAway1": "How security alert fatigue affects companies and organizations today",
            "sessionKeyTakeAway2": "How open source security is affected",
            "sessionKeyTakeAway3": "How to reason around false security alters in open source security",
            "sessionKeyTakeAway4": "Guidance on what questions to ask as a company when evaluating security solutions",
            "sessionLevel": "20",
            "sessionSpeakerName": "Emil Wåreus",
            "sessionTagMain": "Security",
            "sessionTags": [],
            "sessionTitle": "The Cry Wolf Vulnerability Paradox: The Problem of FALSE Alerts in Vulnerability Scanners",
            "sessionTitleShort": "The Cry Wolf Vulnerability Paradox",
            "sessionType": "40",
            "sessionURL": "the-cry-wolf-vulnerability-paradox-the-problem-of-false-alerts-in-vulnerability-scanners",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "4",
            "sessionScheduleId": "§F5EkNRS32gz2MfwBW§Z569Ch8xnaEsMZjir§4",
            "sessionScheduleRoom": "Nowhere",
            "sessionScheduleSlot": "4",
            "sessionSpeakerImagePuId": "2022_speakers/emil-wareus-debricked-com",
            "sessionSpeakerURL": "emil-w-reus",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "13:00:00"
        },
        {
            "_id": "A94Cmy4dYCaAajTp4",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Build a data platform for seafood analytics from scratch. That was the mission we set out to accomplish. And when I say \"from scratch\" that's not an understatement. The team didn't exist, and the current technology stack consisted of 60k Excel sheets, 150 Access databases and some SQL Server databases. So how do you get from ground zero to a platform that covers ETL, self-learning analysis models, structured data, and a web portal and APIs to present seafood insights to the world? How do you assemble a team with the right roles and profiles? And is it possible to do this in 6 months?",
            "sessionKeyTakeAway1": "What a data platform is",
            "sessionKeyTakeAway2": "How to keep your technological options open as long as you can",
            "sessionKeyTakeAway3": "What's the key to building a strong tech team",
            "sessionLevel": "20",
            "sessionSpeakerName": "Kjetil Klaussen",
            "sessionTagMain": "People & Teams",
            "sessionTags": [
                "Architecture",
                "Data Science",
                "Polyglot & Fringe",
                "Quality & Test"
            ],
            "sessionTitle": "From zero to hero in 6 months",
            "sessionTitleShort": "Developing a data platform from scratch",
            "sessionType": "40",
            "sessionURL": "from-zero-to-hero-in-6-months",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "4",
            "sessionScheduleId": "§F5EkNRS32gz2MfwBW§eWnqdASsnFYcsWrZC§4",
            "sessionScheduleRoom": "Somewhere",
            "sessionScheduleSlot": "4",
            "sessionSpeakerImagePuId": "2022_speakers/kjetil-klaussen-gmail-com",
            "sessionSpeakerURL": "kjetil-klaussen",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "13:00:00"
        },
        {
            "_id": "qzPLduQdfXaTCA4Hg",
            "sessionTitle": "Failing Fast with Data: Bringing CI to the Land of Data",
            "sessionTitleShort": "Failing Fast with Data",
            "sessionLevel": "20",
            "sessionType": "40",
            "sessionTagMain": "Data Science",
            "sessionTags": [
                "DevOps"
            ],
            "sessionKeyTakeAway1": "You can leverage software engineering practices to make your data practices much better",
            "sessionKeyTakeAway2": "Failing fast with data has lots of value",
            "sessionDescription": "This session focuses on software engineering practices that we apply as Data Engineers to shorten our development cycle. I will talk about how we use testing, continuous integration, and feature toggles when developing data pipelines or iterating on data pipelines.",
            "conferencename": "Øredev 2022",
            "sessionURL": "failing-fast-with-data-bringing-ci-to-the-land-of-data",
            "sessionSpeakerName": "Micha Kunze",
            "sessionScheduleDay": "4",
            "sessionScheduleId": "§F5EkNRS32gz2MfwBW§AgyfqDGL2sPCs4Ycj§4",
            "sessionScheduleRoom": "This way",
            "sessionScheduleSlot": "4",
            "sessionSpeakerImagePuId": "2022_speakers/michabenachim-kunze-maersk-com",
            "sessionSpeakerURL": "micha-kunze",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "13:00:00"
        },
        {
            "_id": "YYvqcLZ5fdoQ3xiAc",
            "conferencename": "Øredev 2022",
            "sessionDescription": "Build Systems are often considered to be complex tools, that only a dedicated build guru in your team can fix, or optimize. Why is it this way?\n\nIn this talk I want to explore with you how tools like Make or vite work from first principles, from their very smallest ideas and parts, and explore their shortcomings.",
            "sessionKeyTakeAway1": "Come learn from first principles how your build systems do things!",
            "sessionKeyTakeAway2": "Learn key things to keep in mind when debugging and improving your build infrastructure",
            "sessionLevel": "10",
            "sessionSpeakerName": "Leandro Ostera",
            "sessionTagMain": "Web",
            "sessionTags": [],
            "sessionTitle": "Who Builds the Build Systems",
            "sessionType": "40",
            "sessionURL": "who-builds-the-build-systems",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "4",
            "sessionScheduleId": "§F5EkNRS32gz2MfwBW§fcC2ASEZqJbm2mzhT§4",
            "sessionScheduleRoom": "Upstairs",
            "sessionScheduleSlot": "4",
            "sessionSpeakerImagePuId": "2022_speakers/leandro-abstractmachines-dev",
            "sessionSpeakerURL": "leandro-ostera",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "13:00:00"
        },
        {
            "_id": "jv8gLNacWrJhx3iiB",
            "conferencename": "Øredev 2022",
            "sessionDescription": "After some time searching for the best programming language for my projects, I wondered: is there a programming language that does not use any English keyword?\nOf course, the short answer is no, but where do all the other non-English-based programming languages hide? How did we end up using that idiom for writing code?\nLet's explore these questions during this talk!",
            "sessionKeyTakeAway1": "What the history of programming is",
            "sessionKeyTakeAway2": "How programming languages evolved, becoming those we know today, and how will evolve in the future",
            "sessionLevel": "10",
            "sessionSpeakerName": "Michele Riva",
            "sessionTagMain": "Polyglot & Fringe",
            "sessionTags": [],
            "sessionTitle": "Are all programming languages in english?",
            "sessionURL": "are-all-programming-languages-in-english-",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "4",
            "sessionScheduleId": "§F5EkNRS32gz2MfwBW§SMpH8XCoBZXKY5f9n§4",
            "sessionScheduleRoom": "Wonderland",
            "sessionScheduleSlot": "4",
            "sessionSpeakerImagePuId": "2022_speakers/michele-riva-nearform-com",
            "sessionSpeakerURL": "michele-riva",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "13:00:00"
        },
        {
            "_id": "PhrGA2NziBuGcr4NZ",
            "conferencename": "Øredev 2022",
            "sessionDescription": "The presentation will demonstrate how to implement data lake infrastructure in the cloud. It will be AWS cloud flavoured, but the principles are universal. There will be an introduction to the concepts to establish the basic understanding, followed by all the steps needed to arrive at the goal architecture and deploy the solution in the cloud, on top of the presented foundations.\n\nThe goal is to deliver a practical session on how the implementation of data lake in the context of cloud-based environment can be facilitated using infrastructure as code approach. Here the examples will be based on AWS cloud, and specifically an open source library called AWS CDK.",
            "sessionKeyTakeAway1": "Implementing data lake architecture from scratch in the cloud environment.",
            "sessionKeyTakeAway2": "Building reusable infrastructure components as a code (IaC).",
            "sessionKeyTakeAway3": "Getting familiar with AWS CDK and data processing components of AWS.",
            "sessionLevel": "20",
            "sessionSpeakerName": "Krzysztof Slowinski",
            "sessionTagMain": "Cloud",
            "sessionTags": [
                "Architecture",
                "Data Science",
                "DevOps"
            ],
            "sessionTitle": "Data Lake with AWS CDK",
            "sessionType": "40",
            "sessionURL": "data-lake-with-aws-cdk",
            "sessionSpeakersOther": [],
            "sessionScheduleDay": "4",
            "sessionScheduleId": "§F5EkNRS32gz2MfwBW§LYCz3myi2sMKuztYB§4",
            "sessionScheduleRoom": "Wrong way",
            "sessionScheduleSlot": "4",
            "sessionSpeakerImagePuId": "2022_speakers/krzysztof-kodlot-com",
            "sessionSpeakerURL": "krzysztof-slowinski",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "13:00:00"
        },
        {
            "_id": "AJL9uSaeyPT83W2q3",
            "conferencename": "Øredev 2022",
            "sessionDescription": "The last decade has seen a variety of digital attacks against the media. From harassment and phishing, to targeted malware and 0day exploits. This talk will define journalism/security, share insights into working in a newsroom, and discuss what it takes to secure journalists in 2022.",
            "sessionKeyTakeAway1": "TBA",
            "sessionKeyTakeAway2": "TBA",
            "sessionLevel": "20",
            "sessionSpeakerName": "Runa Sandvik",
            "sessionSpeakersOther": [],
            "sessionTagMain": "Keynote",
            "sessionTags": [],
            "sessionTitle": "Securing Journalists in 2022",
            "sessionTitleShort": "Securing Journalists in 2022",
            "sessionType": "40",
            "sessionURL": "securing-journalists-in-2022",
            "sessionScheduleDay": "4",
            "sessionScheduleId": "§F5EkNRS32gz2MfwBW§SMpH8XCoBZXKY5f9n§5",
            "sessionScheduleRoom": "Wonderland",
            "sessionScheduleSlot": "5",
            "sessionSpeakerImagePuId": "2022_speakers/runa-sandvik-gmail-com",
            "sessionSpeakerURL": "runa-sandvik",
            "otherSpeakersShow": [
                null
            ],
            "sessionScheduleTime": "14:20:00"
        }
    ]
}
